alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h

/****************************************************************************************************//**
 * @file     TLE986x.h
 *
 * @brief    CMSIS Cortex-M3 Peripheral Access Layer Header File for
 *           Infineon Technologies ePower Family TLE986x
 *
 * @version  V2.10
 * @date     14. Jan 2016
 *
 * @note     Generated with SVDConv V2.78b 
 *
 * @note:    Generated for MISRA Compliance, this File is NOT CMSIS compliant.
 *******************************************************************************************************/



/** @addtogroup (null)
  * @{
  */

/** @addtogroup TLE986x
  * @{
  */

#ifndef TLE986x_H
#define TLE986x_H

#include <tle_device.h>

#ifdef __cplusplus
extern "C" {
#endif

/*----------------------------------------------------------------------------
  Define Memory
 *----------------------------------------------------------------------------*/
#define ProgFlashStart  (0x11000000U)      /* Start Address of the flash      */
#define DataFlashSize   (0x1000U)          /* 4KB Data Flash                  */
#define DataFlashStart  (ProgFlashStart + ProgFlashSize)
#define NACStart        (DataFlashStart - 4U)
#define NADStart        (DataFlashStart - 2U)
#define RAMStart        (0x18000000UL)     /* Start Address of the SRAM       */

/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -------------------  Cortex-M3 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NonMaskableInt_IRQn           = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  MemoryManagement_IRQn         = -12,              /*!<   4  Memory Management, MPU mismatch, including Access Violation
                                                         and No Match                                                          */
  BusFault_IRQn                 = -11,              /*!<   5  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                         related Fault                                                         */
  UsageFault_IRQn               = -10,              /*!<   6  Usage Fault, i.e. Undef Instruction, Illegal State Transition    */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */
  DebugMonitor_IRQn             =  -4,              /*!<  12  Debug Monitor                                                    */
  PendSV_IRQn                   =  -2,              /*!<  14  Pendable request for system service                              */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* --------------------  TLE986x Specific Interrupt Numbers  -------------------- */
  GPT1_Int                      = 0,                /*!<  Interrupt node 0: GPT1 Block             */
  GPT2_Int                      = 1,                /*!<  Interrupt node 1: GPT2 Block             */
  ADC2_Tmr3_Int                 = 2,                /*!<  Interrupt node 2: ADC2, Timer3, BEMF     */
  ADC1_VREF5_Int                = 3,                /*!<  Interrupt node 3: ADC1, VREF5V           */
  CCU6_SR0_Int                  = 4,                /*!<  Interrupt node 4: CCU6 node0             */
  CCU6_SR1_Int                  = 5,                /*!<  Interrupt node 5: CCU6 node1             */
  CCU6_SR2_Int                  = 6,                /*!<  Interrupt node 6: CCU6 node2             */
  CCU6_SR3_Int                  = 7,                /*!<  Interrupt node 7: CCU6 node3             */
  SSC1_Int                      = 8,                /*!<  Interrupt node 8: SSC1                   */
  SSC2_Int                      = 9,                /*!<  Interrupt node 9: SSC2                   */
  UART1_LIN_Tmr2_Int            =10,                /*!<  Interrupt node10: UART1(ASC,LIN), Timer2 */
  UART2_Tmr21_EINT2_Int         =11,                /*!<  Interrupt node11: UART2, Timer21, EINT2  */
  EXINT0_MON_Int                =12,                /*!<  Interrupt node12: EINT0, MON             */
  EXINT1_Int                    =13,                /*!<  Interrupt node13: EINT1                  */
  BDRV_CP_Int                   =14,                /*!<  Interrupt node14: BDRV, Charge Pump      */
  DMA_Int                       =15,                /*!<  Interrupt node15: DMA                    */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the Cortex-M3 Processor and Core Peripherals---------------- */
#define __CM3_REV                 0x0000            /*!< Cortex-M3 Core Revision                                               */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               4            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
/** @} */ /* End of group Configuration_of_CMSIS */

#include <core_cm3.h>                               /*!< Cortex-M3 processor and core peripherals                              */
#include "system_TLE986x.h"                         /*!< TLE9869 System                                                        */


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  /* TBD. pragmas for anonymous unions */
#else
  #warning Not supported compiler type
#endif


/* ================================================================================ */
/* ================                       SCU                      ================ */
/* ================================================================================ */


/**
  * @brief SCU (SCU)
  */

typedef struct {                                    /*!< (@ 0x50005000) SCU Structure                                          */
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x50005000) NMI Clear Register, RESET_TYPE_3                       */
    
