alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __O  uint8_t   NMIWDTC    :  1;               /*!< [0..0] Watchdog Timer NMI Clear                                       */
      __O  uint8_t   NMIPLLC    :  1;               /*!< [1..1] PLL Loss of Lock NMI Clear                                     */
      __O  uint8_t   NMINVMC    :  1;               /*!< [2..2] NVM Operation Complete NMI Clear                               */
      __O  uint8_t   NMIOTC     :  1;               /*!< [3..3] NMI OT Clear                                                   */
      __O  uint8_t   NMIOWDC    :  1;               /*!< [4..4] Oscillator Watchdog NMI Clear                                  */
      __O  uint8_t   NMIMAPC    :  1;               /*!< [5..5] NVM Map Error NMI Clear                                        */
      __O  uint8_t   NMIECCC    :  1;               /*!< [6..6] ECC Error NMI Clear                                            */
      __O  uint8_t   NMISUPC    :  1;               /*!< [7..7] Supply Prewarning NMI Clear                                    */
    } bit;                                          /*!< [8] BitSize                                                           */
  } NMICLR;
  __I  uint8_t   RESERVED0[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50005004) Interrupt Request Register 0, RESET_TYPE_3             */
    
    struct {
      __I  uint8_t   EXINT0R    :  1;               /*!< [0..0] Interrupt Flag for External Interrupt 0x on rising edge        */
      __I  uint8_t   EXINT0F    :  1;               /*!< [1..1] Interrupt Flag for External Interrupt 0x on falling edge       */
      __I  uint8_t   EXINT1R    :  1;               /*!< [2..2] Interrupt Flag for External Interrupt 1x on rising edge        */
      __I  uint8_t   EXINT1F    :  1;               /*!< [3..3] Interrupt Flag for External Interrupt 1x on falling edge       */
      __I  uint8_t   EXINT2R    :  1;               /*!< [4..4] Interrupt Flag for External Interrupt 2x on rising edge        */
      __I  uint8_t   EXINT2F    :  1;               /*!< [5..5] Interrupt Flag for External Interrupt 2x on falling edge       */
      __I  uint8_t   MONR       :  1;               /*!< [6..6] Interrupt Flag for External Interrupt MON on rising edge       */
      __I  uint8_t   MONF       :  1;               /*!< [7..7] Interrupt Flag for External Interrupt MON on falling
                                                         edge                                                                  */
    } bit;                                          /*!< [8] BitSize                                                           */
  } IRCON0;
  __I  uint8_t   RESERVED1[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50005008) Interrupt Request Register 1, RESET_TYPE_3             */
    
    struct {
      __I  uint8_t   EIR        :  1;               /*!< [0..0] Error Interrupt Flag for SSC1                                  */
      __I  uint8_t   TIR        :  1;               /*!< [1..1] Transmit Interrupt Flag for SSC1                               */
      __I  uint8_t   RIR        :  1;               /*!< [2..2] Receive Interrupt Flag for SSC1                                */
    } bit;                                          /*!< [3] BitSize                                                           */
  } IRCON1;
  __I  uint8_t   RESERVED2[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x5000500C) Interrupt Request Register 2, RESET_TYPE_3             */
    
    struct {
      __I  uint8_t   EIR        :  1;               /*!< [0..0] Error Interrupt Flag for SSC2                                  */
      __I  uint8_t   TIR        :  1;               /*!< [1..1] Transmit Interrupt Flag for SSC2                               */
      __I  uint8_t   RIR        :  1;               /*!< [2..2] Receive Interrupt Flag for SSC2                                */
    } bit;                                          /*!< [3] BitSize                                                           */
  } IRCON2;
  __I  uint8_t   RESERVED3[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50005010) Interrupt Request Register 3, RESET_TYPE_3             */
    
    struct {
      __I  uint8_t   CCU6SR0    :  1;               /*!< [0..0] Interrupt Flag 0 for CCU6                                      */
           uint8_t              :  3;
      __I  uint8_t   CCU6SR1    :  1;               /*!< [4..4] Interrupt Flag 1 for CCU6                                      */
    } bit;                                          /*!< [5] BitSize                                                           */
  } IRCON3;
  __I  uint8_t   RESERVED4[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50005014) Interrupt Request Register 4, RESET_TYPE_3             */
    
    struct {
      __I  uint8_t   CCU6SR2    :  1;               /*!< [0..0] Interrupt Flag 2 for CCU6                                      */
           uint8_t              :  3;
      __I  uint8_t   CCU6SR3    :  1;               /*!< [4..4] Interrupt Flag 3 for CCU6                                      */
    } bit;                                          /*!< [5] BitSize                                                           */
  } IRCON4;
  __I  uint8_t   RESERVED5[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50005018) NMI Status Register, RESET_TYPE_4                      */
    
    struct {
      __I  uint8_t   FNMIWDT    :  1;               /*!< [0..0] Watchdog Timer NMI Flag                                        */
      __I  uint8_t   FNMIPLL    :  1;               /*!< [1..1] PLL NMI Flag                                                   */
      __I  uint8_t   FNMINVM    :  1;               /*!< [2..2] NVM Operation Complete NMI Flag                                */
      __I  uint8_t   FNMIOT     :  1;               /*!< [3..3] Over-temperature NMI Flag                                      */
      __I  uint8_t   FNMIOWD    :  1;               /*!< [4..4] Oscillator Watchdog or MI_CLK Watchdog NMI Flag                */
      __I  uint8_t   FNMIMAP    :  1;               /*!< [5..5] NVM Map Error NMI Flag                                         */
      __I  uint8_t   FNMIECC    :  1;               /*!< [6..6] ECC Error NMI Flag                                             */
      __I  uint8_t   FNMISUP    :  1;               /*!< [7..7] Supply Prewarning NMI Flag                                     */
    } bit;                                          /*!< [8] BitSize                                                           */
  } NMISR;
  __I  uint8_t   RESERVED6[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x5000501C) Interrupt Enable Register 0, RESET_TYPE_4              */
    
