alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
           uint8_t              :  7;
      __IO uint8_t   EA         :  1;               /*!< [7..7] Global Interrupt Mask                                          */
    } bit;                                          /*!< [8] BitSize                                                           */
  } IEN0;
  __I  uint8_t   RESERVED7[7];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005024) NMI Control Register, RESET_TYPE_4                     */
    
    struct {
      __IO uint8_t   NMIWDT     :  1;               /*!< [0..0] Watchdog Timer NMI Enable                                      */
      __IO uint8_t   NMIPLL     :  1;               /*!< [1..1] PLL Loss of Lock NMI Enable                                    */
      __IO uint8_t   NMINVM     :  1;               /*!< [2..2] NVM Operation Complete NMI Enable                              */
      __IO uint8_t   NMIOT      :  1;               /*!< [3..3] NMI OT Enable                                                  */
      __IO uint8_t   NMIOWD     :  1;               /*!< [4..4] Oscillator Watchdog NMI Enable                                 */
      __IO uint8_t   NMIMAP     :  1;               /*!< [5..5] NVM Map Error NMI Enable                                       */
      __IO uint8_t   NMIECC     :  1;               /*!< [6..6] ECC Error NMI Enable                                           */
      __IO uint8_t   NMISUP     :  1;               /*!< [7..7] Supply Prewarning NMI Enable                                   */
    } bit;                                          /*!< [8] BitSize                                                           */
  } NMICON;
  __I  uint8_t   RESERVED8[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005028) External Interrupt Control Register 0, RESET_TYPE_3    */
    
    struct {
      __IO uint8_t   EXINT0     :  2;               /*!< [0..1] External Interrupt 0 Trigger Select                            */
      __IO uint8_t   EXINT1     :  2;               /*!< [2..3] External Interrupt 1 Trigger Select                            */
      __IO uint8_t   EXINT2     :  2;               /*!< [4..5] External Interrupt 2 Trigger Select                            */
      __IO uint8_t   MON        :  2;               /*!< [6..7] MON Input Trigger Select                                       */
    } bit;                                          /*!< [8] BitSize                                                           */
  } EXICON0;
  __I  uint8_t   RESERVED9[3];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x5000502C) Interrupt Request 0 Clear Register, RESET_TYPE_3       */
    
    struct {
      __O  uint8_t   EXINT0RC   :  1;               /*!< [0..0] Interrupt Flag for External Interrupt 0x on rising edge
                                                         clear                                                                 */
      __O  uint8_t   EXINT0FC   :  1;               /*!< [1..1] Interrupt Flag for External Interrupt 0x on falling edge
                                                         clear                                                                 */
      __O  uint8_t   EXINT1RC   :  1;               /*!< [2..2] Interrupt Flag for External Interrupt 1x on rising edge
                                                         clear                                                                 */
      __O  uint8_t   EXINT1FC   :  1;               /*!< [3..3] Interrupt Flag for External Interrupt 1x on falling edge
                                                         clear                                                                 */
      __O  uint8_t   EXINT2RC   :  1;               /*!< [4..4] Interrupt Flag for External Interrupt 2x on rising edge
                                                         clear                                                                 */
      __O  uint8_t   EXINT2FC   :  1;               /*!< [5..5] Interrupt Flag for External Interrupt 2x on falling edge
                                                         clear                                                                 */
      __O  uint8_t   MONRC      :  1;               /*!< [6..6] Interrupt Flag for External Interrupt MON on rising edge
                                                         clear                                                                 */
      __O  uint8_t   MONFC      :  1;               /*!< [7..7] Interrupt Flag for External Interrupt MON on falling
                                                         edge clear                                                            */
    } bit;                                          /*!< [8] BitSize                                                           */
  } IRCON0CLR;
  __I  uint8_t   RESERVED10[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005030) Peripheral Interrupt Enable Register 1, RESET_TYPE_3   */
    
    struct {
      __IO uint8_t   EIREN1     :  1;               /*!< [0..0] SSC 1 Error Interrupt Enable                                   */
      __IO uint8_t   TIREN1     :  1;               /*!< [1..1] SSC 1 Transmit Interrupt Enable                                */
      __IO uint8_t   RIREN1     :  1;               /*!< [2..2] SSC 1 Receive Interrupt Enable                                 */
           uint8_t              :  3;
      __IO uint8_t   RIEN1      :  1;               /*!< [6..6] UART 1 Receive Interrupt Enable                                */
      __IO uint8_t   TIEN1      :  1;               /*!< [7..7] UART 1 Transmit Interrupt Enable                               */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MODIEN1;
  __I  uint8_t   RESERVED11[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005034) Peripheral Interrupt Enable Register 2, RESET_TYPE_3   */
    
