alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint8_t   EIREN2     :  1;               /*!< [0..0] SSC 2 Error Interrupt Enable                                   */
      __IO uint8_t   TIREN2     :  1;               /*!< [1..1] SSC 2 Transmit Interrupt Enable                                */
      __IO uint8_t   RIREN2     :  1;               /*!< [2..2] SSC 2 Receive Interrupt Enable                                 */
           uint8_t              :  2;
      __IO uint8_t   EXINT2_EN  :  1;               /*!< [5..5] External Interrupt 2 Enable                                    */
      __IO uint8_t   RIEN2      :  1;               /*!< [6..6] UART 2 Receive Interrupt Enable                                */
      __IO uint8_t   TIEN2      :  1;               /*!< [7..7] UART 2 Transmit Interrupt Enable                               */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MODIEN2;
  __I  uint8_t   RESERVED12[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005038) Peripheral Interrupt Enable Register 3, RESET_TYPE_3   */
    
    struct {
      __IO uint8_t   IE0        :  1;               /*!< [0..0] External Interrupt Enable                                      */
           uint8_t              :  3;
      __IO uint8_t   MONIE      :  1;               /*!< [4..4] MON Interrupt Enable                                           */
      __I  uint8_t   MONSTS     :  1;               /*!< [5..5] MON Input Status                                               */
    } bit;                                          /*!< [6] BitSize                                                           */
  } MODIEN3;
  __I  uint8_t   RESERVED13[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x5000503C) Peripheral Interrupt Enable Register 4, RESET_TYPE_3   */
    
    struct {
      __IO uint8_t   IE1        :  1;               /*!< [0..0] External Interrupt Enable                                      */
    } bit;                                          /*!< [1] BitSize                                                           */
  } MODIEN4;
  __I  uint8_t   RESERVED14[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005040) Power Mode Control Register 0, RESET_TYPE_3            */
    
    struct {
      __IO uint8_t   XTAL_ON    :  1;               /*!< [0..0] OSC_HP Operation in Power Down Mode                            */
      __IO uint8_t   SL         :  1;               /*!< [1..1] Sleep Mode Enable. Active High.                                */
      __IO uint8_t   PD         :  1;               /*!< [2..2] Power Down Mode Enable. Active High.                           */
      __IO uint8_t   SD         :  1;               /*!< [3..3] Slow Down Mode Enable. Active High.                            */
    } bit;                                          /*!< [4] BitSize                                                           */
  } PMCON0;
  __I  uint8_t   RESERVED15[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005044) PLL Control Register, RESET_TYPE_4                     */
    
    struct {
      __I  uint8_t   LOCK       :  1;               /*!< [0..0] PLL Lock Status Flag                                           */
      __IO uint8_t   RESLD      :  1;               /*!< [1..1] Restart Lock Detection                                         */
      __IO uint8_t   OSCDISC    :  1;               /*!< [2..2] Oscillator Disconnect                                          */
      __IO uint8_t   VCOBYP     :  1;               /*!< [3..3] PLL VCO Bypass Mode Select                                     */
      __IO uint8_t   NDIV       :  4;               /*!< [4..7] PLL N-Divider                                                  */
    } bit;                                          /*!< [8] BitSize                                                           */
  } PLL_CON;
  __I  uint8_t   RESERVED16[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005048) Clock Control Register 1, RESET_TYPE_4                 */
    
    struct {
      __IO uint8_t   CLKREL     :  4;               /*!< [0..3] Slow Down Clock Divider for fCCLK Generation                   */
      __IO uint8_t   K2DIV      :  2;               /*!< [4..5] PLL K2-Divider                                                 */
      __IO uint8_t   K1DIV      :  1;               /*!< [6..6] PLL K1-Divider                                                 */
      __IO uint8_t   VCOSEL     :  1;               /*!< [7..7] VCOSEL Setting                                                 */
    } bit;                                          /*!< [8] BitSize                                                           */
  } CMCON1;
  __I  uint8_t   RESERVED17[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x5000504C) Clock Control Register 2, RESET_TYPE_4                 */
    
    struct {
      __IO uint8_t   PBA0CLKREL :  1;               /*!< [0..0] PBA0 Clock Divider                                             */
    } bit;                                          /*!< [1] BitSize                                                           */
  } CMCON2;
  __I  uint8_t   RESERVED18[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005050) Watchdog Timer Control Register, RESET_TYPE_3          */
    
    struct {
      __IO uint8_t   WDTIN      :  1;               /*!< [0..0] Watchdog Timer Input Frequency Selection                       */
      __IO uint8_t   WDTRS      :  1;               /*!< [1..1] WDT Refresh Start                                              */
      __IO uint8_t   WDTEN      :  1;               /*!< [2..2] WDT Enable                                                     */
           uint8_t              :  1;
      __I  uint8_t   WDTPR      :  1;               /*!< [4..4] Watchdog Prewarning Mode Flag                                  */
      __IO uint8_t   WINBEN     :  1;               /*!< [5..5] Watchdog Window-Boundary Enable                                */
    } bit;                                          /*!< [6] BitSize                                                           */
  } WDTCON;
  __I  uint8_t   RESERVED19[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005054) Analog Peripheral Clock Control 1 Register, RESET_TYPE_4 */
    
