alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint8_t   R          :  1;               /*!< [0..0] Baud Rate Generator Run Control Bit                            */
      __IO uint8_t   BRPRE      :  3;               /*!< [1..3] Prescaler Bit                                                  */
    } bit;                                          /*!< [4] BitSize                                                           */
  } BCON2;
  __I  uint8_t   RESERVED37[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x5000509C) Baud Rate Timer/Reload Register, Low Byte 2,
                                                         RESET_TYPE_3                                                          */
    
    struct {
      __IO uint8_t   FD_SEL     :  5;               /*!< [0..4] Fractional Divider Selection                                   */
      __IO uint8_t   BR_VALUE   :  3;               /*!< [5..7] Baud Rate Timer/Reload Value                                   */
    } bit;                                          /*!< [8] BitSize                                                           */
  } BGL2;
  __I  uint8_t   RESERVED38[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050A0) Baud Rate Timer/Reload Register, High Byte, RESET_TYPE_3 */
    
    struct {
      __IO uint8_t   BR_VALUE   :  8;               /*!< [0..7] Baud Rate Timer/Reload Value                                   */
    } bit;                                          /*!< [8] BitSize                                                           */
  } BGH2;
  __I  uint8_t   RESERVED39[3];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x500050A4) LIN Status Clear Register, RESET_TYPE_3                */
    
    struct {
           uint8_t              :  3;
      __O  uint8_t   BRKC       :  1;               /*!< [3..3] Break Field Flag Clear                                         */
      __O  uint8_t   EOFSYNC    :  1;               /*!< [4..4] End of SYN Byte Interrupt Flag Clear                           */
      __O  uint8_t   ERRSYNC    :  1;               /*!< [5..5] SYN Byte Error Interrupt Flag                                  */
    } bit;                                          /*!< [6] BitSize                                                           */
  } LINSCLR;
  __I  uint8_t   RESERVED40[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x500050A8) Identity Register, RESET_TYPE_3                        */
    
    struct {
      __I  uint8_t   VERID      :  3;               /*!< [0..2] Version ID                                                     */
      __I  uint8_t   PRODID     :  5;               /*!< [3..7] Product ID                                                     */
    } bit;                                          /*!< [8] BitSize                                                           */
  } ID;
  __I  uint8_t   RESERVED41[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050AC) Password Register, RESET_TYPE_3                        */
    
    struct {
      __IO uint8_t   MODE       :  2;               /*!< [0..1] Bit-Protection Scheme Control Bit                              */
      __I  uint8_t   PROTECT_S  :  1;               /*!< [2..2] Bit-Protection Signal Status Bit                               */
      __O  uint8_t   PASS       :  5;               /*!< [3..7] Password Bits                                                  */
    } bit;                                          /*!< [8] BitSize                                                           */
  } PASSWD;
  __I  uint8_t   RESERVED42[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050B0) OSC Control Register, RESET_TYPE_4                     */
    
    struct {
      __IO uint8_t   OSCSS      :  2;               /*!< [0..1] Oscillator Source Select                                       */
      __IO uint8_t   OSCWDTRST  :  1;               /*!< [2..2] Oscillator Watchdog Reset                                      */
      __I  uint8_t   OSC2L      :  1;               /*!< [3..3] OSC-Too-Low Condition Flag                                     */
      __IO uint8_t   XPD        :  1;               /*!< [4..4] XTAL (OSC_HP) Power Down Control                               */
           uint8_t              :  2;
      __IO uint8_t   OSCTRIM_8  :  1;               /*!< [7..7] OSC_PLL Trim Configuration Bit [8]                             */
    } bit;                                          /*!< [8] BitSize                                                           */
  } OSC_CON;
  __I  uint8_t   RESERVED43[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050B4) Clock Output Control Register, RESET_TYPE_4            */
    
    struct {
      __IO uint8_t   COREL      :  4;               /*!< [0..3] Clock Output Divider                                           */
      __IO uint8_t   COUTS0     :  1;               /*!< [4..4] Clock Out Source Select Bit 0                                  */
      __IO uint8_t   TLEN       :  1;               /*!< [5..5] Toggle Latch Enable                                            */
      __IO uint8_t   COUTS1     :  1;               /*!< [6..6] Clock Out Source Select Bit 1                                  */
      __IO uint8_t   EN         :  1;               /*!< [7..7] CLKOUT Enable                                                  */
    } bit;                                          /*!< [8] BitSize                                                           */
  } COCON;
  __I  uint8_t   RESERVED44[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050B8) Peripheral Input Select Register, RESET_TYPE_3         */
    
    struct {
      __IO uint8_t   EXINT0IS   :  2;               /*!< [0..1] External Interrupt 0 Input Select                              */
      __IO uint8_t   EXINT1IS   :  2;               /*!< [2..3] External Interrupt 1 Input Select                              */
      __IO uint8_t   EXINT2IS   :  2;               /*!< [4..5] External Interrupt 2 Input Select                              */
      __IO uint8_t   URIOS1     :  1;               /*!< [6..6] UART1 Input/Output Select                                      */
      __IO uint8_t   U_TX_CONDIS:  1;               /*!< [7..7] UART1 TxD Connection Disable                                   */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MODPISEL;
  __I  uint8_t   RESERVED45[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500050BC) Peripheral Input Select Register 1, RESET_TYPE_3       */
    
