alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint8_t   PDM2       :  3;               /*!< [0..2] P1.2 Port Driver Mode                                          */
           uint8_t              :  1;
      __IO uint8_t   PDM3       :  3;               /*!< [4..6] P1.3 Port Driver Mode                                          */
    } bit;                                          /*!< [7] BitSize                                                           */
  } P1_POCON1;
  __I  uint8_t   RESERVED62[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005100) Port Output Control Register, RESET_TYPE_3             */
    
    struct {
      __IO uint8_t   PDM4       :  3;               /*!< [0..2] P1.4 Port Driver Mode                                          */
    } bit;                                          /*!< [3] BitSize                                                           */
  } P1_POCON2;
  __I  uint8_t   RESERVED63[11];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x5000510C) Error Detection and Correction Status Clear Register,
                                                         RESET_TYPE_3                                                          */
    
    struct {
      __O  uint8_t   RDBEC      :  1;               /*!< [0..0] RAM Double Bit Error Clear                                     */
           uint8_t              :  1;
      __O  uint8_t   NVMDBEC    :  1;               /*!< [2..2] NVM Double Bit Error Clear                                     */
           uint8_t              :  1;
      __O  uint8_t   RSBEC      :  1;               /*!< [4..4] RAM Single Bit Error Clear                                     */
    } bit;                                          /*!< [5] BitSize                                                           */
  } EDCSCLR;
  __I  uint8_t   RESERVED64[55];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005144) DMA Interrupt Enable Register 1, RESET_TYPE_3          */
    
    struct {
      __IO uint8_t   CH1IE      :  1;               /*!< [0..0] DMA Channel 1 Interrupt Enable                                 */
      __IO uint8_t   CH2IE      :  1;               /*!< [1..1] DMA Channel 2 Interrupt Enable                                 */
      __IO uint8_t   CH3IE      :  1;               /*!< [2..2] DMA Channel 3 Interrupt Enable                                 */
      __IO uint8_t   CH4IE      :  1;               /*!< [3..3] DMA Channel 4 Interrupt Enable                                 */
      __IO uint8_t   CH5IE      :  1;               /*!< [4..4] DMA Channel 5 Interrupt Enable                                 */
      __IO uint8_t   CH6IE      :  1;               /*!< [5..5] DMA Channel 6 Interrupt Enable                                 */
      __IO uint8_t   CH7IE      :  1;               /*!< [6..6] DMA Channel 7 Interrupt Enable                                 */
      __IO uint8_t   CH8IE      :  1;               /*!< [7..7] DMA Channel 8 Interrupt Enable                                 */
    } bit;                                          /*!< [8] BitSize                                                           */
  } DMAIEN1;
  __I  uint8_t   RESERVED65[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005148) DMA Interrupt Enable Register 2, RESET_TYPE_3          */
    
    struct {
      __IO uint8_t   TRERRIE    :  1;               /*!< [0..0] DMA Transfer Error Interrupt Enable                            */
      __IO uint8_t   TRSEQ1RDYIE:  1;               /*!< [1..1] DMA Transfer Sequence 1 Ready Interrupt Enable                 */
      __IO uint8_t   TRSEQ2RDYIE:  1;               /*!< [2..2] DMA Transfer Sequence 2 Ready Interrupt Enable                 */
      __IO uint8_t   SSCTXIE    :  1;               /*!< [3..3] DMA SSC Transmit Transfer Interrupt Enable                     */
      __IO uint8_t   SSCRXIE    :  1;               /*!< [4..4] DMA SSC Receive Transfer Interrupt Enable                      */
      __IO uint8_t   GPT12IE    :  1;               /*!< [5..5] DMA GPT12 triggered Transfer Interrupt Enable                  */
    } bit;                                          /*!< [6] BitSize                                                           */
  } DMAIEN2;
  __I  uint8_t   RESERVED66[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x5000514C) DMA Source Selection Register, RESET_TYPE_3            */
    
    struct {
      __IO uint8_t   SSCTXSRCSEL:  1;               /*!< [0..0] SSCx Transmit Source Select                                    */
      __IO uint8_t   SSCRXSRCSEL:  1;               /*!< [1..1] SSCx Receive Source Select                                     */
      __IO uint8_t   T12ZM_DMAEN:  1;               /*!< [2..2] CC6_T12_ZM (Zero Match) DMA muxer, DMA channel 10              */
      __IO uint8_t   T12PM_DMAEN:  1;               /*!< [3..3] CC6_T12_PM (Period Match) DMA muxer, DMA channel 11            */
           uint8_t              :  1;
      __I  uint8_t   SSCTX      :  1;               /*!< [5..5] SSC Transmit Request                                           */
      __I  uint8_t   SSCRX      :  1;               /*!< [6..6] SSC Receive Request                                            */
      __I  uint8_t   GPT12_T3   :  1;               /*!< [7..7] GPT12 Transmit Request                                         */
    } bit;                                          /*!< [8] BitSize                                                           */
  } DMASRCSEL;
  __I  uint8_t   RESERVED67[7];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50005154) DMA Interrupt Control Register 1, RESET_TYPE_3         */
    
    struct {
      __I  uint8_t   CH1        :  1;               /*!< [0..0] DMA ADC Channel 1 Interrupt Status (DMA channel 4)             */
      __I  uint8_t   CH2        :  1;               /*!< [1..1] DMA ADC Channel 2 Interrupt Status (DMA channel 5)             */
      __I  uint8_t   CH3        :  1;               /*!< [2..2] DMA ADC Channel 3 Interrupt Status (DMA channel 6)             */
      __I  uint8_t   CH4        :  1;               /*!< [3..3] DMA ADC Channel 4 Interrupt Status (DMA channel 7)             */
      __I  uint8_t   CH5        :  1;               /*!< [4..4] DMA ADC Channel 5 Interrupt Status (DMA channel 8)             */
      __I  uint8_t   CH6        :  1;               /*!< [5..5] DMA ADC Channel 6 Interrupt Status (DMA channel 9)             */
      __I  uint8_t   CH7        :  1;               /*!< [6..6] DMA ADC Channel 7 Interrupt Status (DMA channel 10)            */
      __I  uint8_t   CH8        :  1;               /*!< [7..7] DMA ADC Channel 8 Interrupt Status (DMA channel 11)            */
    } bit;                                          /*!< [8] BitSize                                                           */
  } DMAIRC1;
  __I  uint8_t   RESERVED68[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50005158) ADC1 Interrupt Control Register 2, RESET_TYPE_3        */
    
