alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __I  uint8_t   STRDY      :  1;               /*!< [0..0] DMA Single Transfer Ready                                      */
      __I  uint8_t   TRSEQ1DY   :  1;               /*!< [1..1] DMA Transfer Sequence 1 Ready (DMA channel 0)                  */
      __I  uint8_t   TRSEQ2DY   :  1;               /*!< [2..2] DMA Transfer Sequence 2 Ready (DMA channel 1)                  */
      __I  uint8_t   SSC1       :  1;               /*!< [3..3] DMA SSC1 Transfer Ready (DMA channel 2)                        */
      __I  uint8_t   SSC2       :  1;               /*!< [4..4] DMA SSC2 Transfer Ready (DMA channel 3)                        */
      __I  uint8_t   GPT12      :  1;               /*!< [5..5] DMA GPT12 Transfer Ready (DMA channel 12)                      */
    } bit;                                          /*!< [6] BitSize                                                           */
  } DMAIRC2;
  __I  uint8_t   RESERVED69[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x5000515C) General Purpose Timer 12 Interrupt Enable Register
                                                         , RESET_TYPE_3                                                        */
    
    struct {
      __IO uint8_t   T2IE       :  1;               /*!< [0..0] General Purpose Timer 12 T2 Interrupt Enable                   */
      __IO uint8_t   T3IE       :  1;               /*!< [1..1] General Purpose Timer 12 T3 Interrupt Enable                   */
      __IO uint8_t   T4IE       :  1;               /*!< [2..2] General Purpose Timer 12 T4 Interrupt Enable                   */
      __IO uint8_t   T5IE       :  1;               /*!< [3..3] General Purpose Timer 12 T5 Interrupt Enable                   */
      __IO uint8_t   T6IE       :  1;               /*!< [4..4] General Purpose Timer 12 T6 Interrupt Enable                   */
      __IO uint8_t   CRIE       :  1;               /*!< [5..5] General Purpose Timer 12 Capture and Reload Interrupt
                                                         Enable                                                                */
    } bit;                                          /*!< [6] BitSize                                                           */
  } GPT12IEN;
  __I  uint8_t   RESERVED70[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50005160) Timer and Counter Control/Status Register, RESET_TYPE_3 */
    
    struct {
      __I  uint8_t   T2         :  1;               /*!< [0..0] GPT Module 1 Timer 2 Interrupt Status                          */
      __I  uint8_t   T3         :  1;               /*!< [1..1] GPT Module 1 Timer3 Interrupt Status                           */
      __I  uint8_t   T4         :  1;               /*!< [2..2] GPT Module 1 Timer4 Interrupt Status                           */
      __I  uint8_t   T5         :  1;               /*!< [3..3] GPT Module 2 Timer5 Interrupt Status                           */
      __I  uint8_t   T6         :  1;               /*!< [4..4] GPT Module 2Timer6 Interrupt Status                            */
      __I  uint8_t   CR         :  1;               /*!< [5..5] GPT Module 2 Capture Reload Interrupt Status                   */
    } bit;                                          /*!< [6] BitSize                                                           */
  } GPT12IRC;
  __I  uint8_t   RESERVED71[3];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x50005164) Timer and Counter Control/Status Clear Register,
                                                         RESET_TYPE_3                                                          */
    
    struct {
      __O  uint8_t   T2C        :  1;               /*!< [0..0] GPT Module 1 Timer 2 Interrupt Status Clear                    */
      __O  uint8_t   T3C        :  1;               /*!< [1..1] GPT Module 1 Timer3 Interrupt Status Clear                     */
      __O  uint8_t   T4C        :  1;               /*!< [2..2] GPT Module 1 Timer4 Interrupt Status Clear                     */
      __O  uint8_t   T5C        :  1;               /*!< [3..3] GPT Module 2 Timer5 Interrupt Status Clear                     */
      __O  uint8_t   T6C        :  1;               /*!< [4..4] GPT Module 2Timer6 Interrupt Status Clear                      */
      __O  uint8_t   CRC        :  1;               /*!< [5..5] GPT Module 2 Capture Reload Interrupt Status Clear             */
    } bit;                                          /*!< [6] BitSize                                                           */
  } GPT12ICLR;
  __I  uint8_t   RESERVED72[19];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x50005178) Interrupt Request 1 Clear Register, RESET_TYPE_3       */
    
    struct {
      __O  uint8_t   EIRC       :  1;               /*!< [0..0] Error Interrupt Flag for SSC1 Clear                            */
      __O  uint8_t   TIRC       :  1;               /*!< [1..1] Transmit Interrupt Flag for SSC1 Clear                         */
      __O  uint8_t   RIRC       :  1;               /*!< [2..2] Receive Interrupt Flag for SSC1 Clear                          */
    } bit;                                          /*!< [3] BitSize                                                           */
  } IRCON1CLR;
  __I  uint8_t   RESERVED73[3];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x5000517C) Interrupt Request 2 Clear Register, RESET_TYPE_3       */
    
    struct {
      __O  uint8_t   EIRC       :  1;               /*!< [0..0] Error Interrupt Flag for SSC2 Clear                            */
      __O  uint8_t   TIRC       :  1;               /*!< [1..1] Transmit Interrupt Flag for SSC2 Clear                         */
      __O  uint8_t   RIRC       :  1;               /*!< [2..2] Receive Interrupt Flag for SSC2 Clear                          */
    } bit;                                          /*!< [3] BitSize                                                           */
  } IRCON2CLR;
  __I  uint8_t   RESERVED74[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50005180) DMA Source Selection Register 2, RESET_TYPE_3          */
    
