alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint8_t   GPT12_DMAEN:  2;               /*!< [0..1] GPT12 T3 DMA muxer, DMA channel 12                             */
    } bit;                                          /*!< [2] BitSize                                                           */
  } DMASRCSEL2;
  __I  uint8_t   RESERVED75[3];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x50005184) DMA Interrupt Control 1 Clear Register, RESET_TYPE_3   */
    
    struct {
      __O  uint8_t   CH1C       :  1;               /*!< [0..0] DMA ADC Channel 1 Interrupt Status (DMA channel 4) Clear       */
      __O  uint8_t   CH2C       :  1;               /*!< [1..1] DMA ADC Channel 2 Interrupt Status (DMA channel 5) Clear       */
      __O  uint8_t   CH3C       :  1;               /*!< [2..2] DMA ADC Channel 3 Interrupt Status (DMA channel 6) Clear       */
      __O  uint8_t   CH4C       :  1;               /*!< [3..3] DMA ADC Channel 4 Interrupt Status (DMA channel 7) Clear       */
      __O  uint8_t   CH5C       :  1;               /*!< [4..4] DMA ADC Channel 5 Interrupt Status (DMA channel 8) Clear       */
      __O  uint8_t   CH6C       :  1;               /*!< [5..5] DMA ADC Channel 6 Interrupt Status (DMA channel 9) Clear       */
      __O  uint8_t   CH7C       :  1;               /*!< [6..6] DMA ADC Channel 7 Interrupt Status (DMA channel 10) Clear      */
      __O  uint8_t   CH8C       :  1;               /*!< [7..7] DMA ADC Channel 8 Interrupt Status (DMA channel 11) Clear      */
    } bit;                                          /*!< [8] BitSize                                                           */
  } DMAIRC1CLR;
  __I  uint8_t   RESERVED76[3];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x50005188) ADC1 Interrupt Control 2 Clear Register, RESET_TYPE_3  */
    
    struct {
           uint8_t              :  1;
      __O  uint8_t   TRSEQ1DYC  :  1;               /*!< [1..1] DMA Transfer Sequence 1 Ready (DMA channel 0) Clear            */
      __O  uint8_t   TRSEQ2DYC  :  1;               /*!< [2..2] DMA Transfer Sequence 2 Ready (DMA channel 1) Clear            */
      __O  uint8_t   SSC1C      :  1;               /*!< [3..3] DMA SSC1 Transfer Ready (DMA channel 2) Clear                  */
      __O  uint8_t   SSC2C      :  1;               /*!< [4..4] DMA SSC2 Transfer Ready (DMA channel 3) Clear                  */
      __O  uint8_t   GPT12C     :  1;               /*!< [5..5] DMA GPT12 Transfer Ready (DMA channel 12) Clear                */
    } bit;                                          /*!< [6] BitSize                                                           */
  } DMAIRC2CLR;
  __I  uint8_t   RESERVED77[7];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x50005190) Interrupt Request 3 Clear Register, RESET_TYPE_3       */
    
    struct {
      __O  uint8_t   CCU6SR0C   :  1;               /*!< [0..0] Interrupt Flag 0 for CCU6 Clear                                */
           uint8_t              :  3;
      __O  uint8_t   CCU6SR1C   :  1;               /*!< [4..4] Interrupt Flag 1 for CCU6 Clear                                */
    } bit;                                          /*!< [5] BitSize                                                           */
  } IRCON3CLR;
  __I  uint8_t   RESERVED78[3];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x50005194) Interrupt Request 4 Clear Register, RESET_TYPE_3       */
    
    struct {
      __O  uint8_t   CCU6SR2C   :  1;               /*!< [0..0] Interrupt Flag 2 for CCU6 Clear                                */
           uint8_t              :  3;
      __O  uint8_t   CCU6SR3C   :  1;               /*!< [4..4] Interrupt Flag 3 for CCU6 Clear                                */
    } bit;                                          /*!< [5] BitSize                                                           */
  } IRCON4CLR;
  __I  uint8_t   RESERVED79[3];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x50005198) DMA Source Selection Clear Register, RESET_TYPE_3      */
    
    struct {
           uint8_t              :  5;
      __O  uint8_t   SSCTXC     :  1;               /*!< [5..5] SSC Transmit Request Clear                                     */
      __O  uint8_t   SSCRXC     :  1;               /*!< [6..6] SSC Receive Request Clear                                      */
      __O  uint8_t   GPT12_T3C  :  1;               /*!< [7..7] GPT12 Transmit Request Clear                                   */
    } bit;                                          /*!< [8] BitSize                                                           */
  } DMASRCCLR;
} SCU_Type;


/* ================================================================================ */
/* ================                      PORT                      ================ */
/* ================================================================================ */


/**
  * @brief PORT (PORT)
  */

typedef struct {                                    /*!< (@ 0x48028000) PORT Structure                                         */
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028000) Port 0 Data Register                                   */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Port 0 Pin 0 Data Value                                        */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Port 0 Pin 1 Data Value                                        */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Port 0 Pin 2 Data Value                                        */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Port 0 Pin 3 Data Value                                        */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Port 0 Pin 4 Data Value                                        */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P0_DATA;
  __I  uint8_t   RESERVED0[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028004) Port 0 Direction Register                              */
    
