alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Pull-Up/Pull-Down Select Port 1 Bit 0                          */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Pull-Up/Pull-Down Select Port 1 Bit 1                          */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Pull-Up/Pull-Down Select Port 1 Bit 2                          */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Pull-Up/Pull-Down Select Port 1 Bit 3                          */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Pull-Up/Pull-Down Select Port 1 Bit 4                          */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P1_PUDSEL;
  __I  uint8_t   RESERVED8[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028024) Port 1 Pull-Up/Pull-Down Enable Register               */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Pull-Up/Pull-Down Enable at Port 1 Bit 0                       */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Pull-Up/Pull-Down Enable at Port 1 Bit 1                       */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Pull-Up/Pull-Down Enable at Port 1 Bit 2                       */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Pull-Up/Pull-Down Enable at Port 1 Bit 3                       */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Pull-Up/Pull-Down Enable at Port 1 Bit 4                       */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P1_PUDEN;
  __I  uint8_t   RESERVED9[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028028) Port 2 Pull-Up/Pull-Down Select Register               */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Pull-Up/Pull-Down Select Port 2 Bit 0                          */
           uint8_t              :  1;
      __IO uint8_t   P2         :  1;               /*!< [2..2] Pull-Up/Pull-Down Select Port 2 Bit 2                          */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Pull-Up/Pull-Down Select Port 2 Bit 3                          */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Pull-Up/Pull-Down Select Port 2 Bit 4                          */
      __IO uint8_t   P5         :  1;               /*!< [5..5] Pull-Up/Pull-Down Select Port 2 Bit 5                          */
    } bit;                                          /*!< [6] BitSize                                                           */
  } P2_PUDSEL;
  __I  uint8_t   RESERVED10[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x4802802C) Port 2 Pull-Up/Pull-Down Enable Register               */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Pull-Up/Pull-Down Enable at Port 2 Bit 0                       */
           uint8_t              :  1;
      __IO uint8_t   P2         :  1;               /*!< [2..2] Pull-Up/Pull-Down Enable at Port 2 Bit 2                       */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Pull-Up/Pull-Down Enable at Port 2 Bit 3                       */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Pull-Up/Pull-Down Enable at Port 2 Bit 4                       */
      __IO uint8_t   P5         :  1;               /*!< [5..5] Pull-Up/Pull-Down Enable at Port 2 Bit 5                       */
    } bit;                                          /*!< [6] BitSize                                                           */
  } P2_PUDEN;
  __I  uint8_t   RESERVED11[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028030) Port 0 Alternate Select Register                       */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Alternate Select Port 0 Bit 0                                  */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Alternate Select Port 0 Bit 1                                  */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Alternate Select Port 0 Bit 2                                  */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Alternate Select Port 0 Bit 3                                  */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Alternate Select Port 0 Bit 4                                  */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P0_ALTSEL0;
  __I  uint8_t   RESERVED12[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028034) Port 0 Alternate Select Register                       */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Alternate Select Port 0 Bit 0                                  */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Alternate Select Port 0 Bit 1                                  */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Alternate Select Port 0 Bit 2                                  */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Alternate Select Port 0 Bit 3                                  */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Alternate Select Port 0 Bit 4                                  */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P0_ALTSEL1;
  __I  uint8_t   RESERVED13[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028038) Port 1 Alternate Select Register                       */
    
