alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Alternate Select Port 1 Bit 0                                  */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Alternate Select Port 1 Bit 1                                  */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Alternate Select Port 1 Bit 2                                  */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Alternate Select Port 1 Bit 3                                  */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Alternate Select Port 1 Bit 4                                  */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P1_ALTSEL0;
  __I  uint8_t   RESERVED14[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x4802803C) Port 1 Alternate Select Register                       */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Alternate Select Port 1 Bit 0                                  */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Alternate Select Port 1 Bit 1                                  */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Alternate Select Port 1 Bit 2                                  */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Alternate Select Port 1 Bit 3                                  */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Alternate Select Port 1 Bit 4                                  */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P1_ALTSEL1;
  __I  uint8_t   RESERVED15[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028040) Port 0 Open Drain Control Register                     */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Port 0 Pin 0 Open Drain Mode                                   */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Port 0 Pin 1 Open Drain Mode                                   */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Port 0 Pin 2 Open Drain Mode                                   */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Port 0 Pin 3 Open Drain Mode                                   */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Port 0 Pin 4 Open Drain Mode                                   */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P0_OD;
  __I  uint8_t   RESERVED16[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48028044) Port 1 Open Drain Control Register                     */
    
    struct {
      __IO uint8_t   P0         :  1;               /*!< [0..0] Port 1 Pin 0 Open Drain Mode                                   */
      __IO uint8_t   P1         :  1;               /*!< [1..1] Port 1 Pin 1 Open Drain Mode                                   */
      __IO uint8_t   P2         :  1;               /*!< [2..2] Port 1 Pin 2 Open Drain Mode                                   */
      __IO uint8_t   P3         :  1;               /*!< [3..3] Port 1 Pin 3 Open Drain Mode                                   */
      __IO uint8_t   P4         :  1;               /*!< [4..4] Port 1 Pin 4 Open Drain Mode                                   */
    } bit;                                          /*!< [5] BitSize                                                           */
  } P1_OD;
} PORT_Type;


/* ================================================================================ */
/* ================                     GPT12E                     ================ */
/* ================================================================================ */


/**
  * @brief GPT12E (GPT12E)
  */

typedef struct {                                    /*!< (@ 0x40010000) GPT12E Structure                                       */
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x40010000) Module Identification Register                         */
    
    struct {
      __I  uint16_t  MOD_REV    :  8;               /*!< [0..7] Module Revision Number                                         */
      __I  uint16_t  MOD_TYPE   :  8;               /*!< [8..15] Module Identification Number                                  */
    } bit;                                          /*!< [16] BitSize                                                          */
  } ID;
  __I  uint16_t  RESERVED0;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x40010004) Port Input Select Register                             */
    
    struct {
      __IO uint16_t  IST2IN     :  1;               /*!< [0..0] Input Select for T2IN                                          */
      __IO uint16_t  IST2EUD    :  1;               /*!< [1..1] Input Select for T2EUD                                         */
      __IO uint16_t  IST3IN     :  2;               /*!< [2..3] Input Select for T3IN                                          */
      __IO uint16_t  IST3EUD    :  2;               /*!< [4..5] Input Select for T3EUD                                         */
      __IO uint16_t  IST4IN     :  2;               /*!< [6..7] Input Select for T4IN                                          */
      __IO uint16_t  IST4EUD    :  2;               /*!< [8..9] Input Select for T4EUD                                         */
      __IO uint16_t  IST5IN     :  1;               /*!< [10..10] Input Select for T5IN                                        */
      __IO uint16_t  IST5EUD    :  1;               /*!< [11..11] Input Select for T5EUD                                       */
      __IO uint16_t  IST6IN     :  1;               /*!< [12..12] Input Select for T6IN                                        */
      __IO uint16_t  IST6EUD    :  1;               /*!< [13..13] Input Select for T6EUD                                       */
      __IO uint16_t  ISCAPIN    :  2;               /*!< [14..15] Input Select for CAPIN                                       */
    } bit;                                          /*!< [16] BitSize                                                          */
  } PISEL;
  __I  uint16_t  RESERVED1;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x40010008) Timer T2 Control Register                              */
    
