alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint8_t   RC2        :  8;               /*!< [0..7] Reload/Capture Value                                           */
    } bit;                                          /*!< [8] BitSize                                                           */
  } RC2L;
  __I  uint8_t   RESERVED2[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x4800400C) Timer 2 Reload/Capture Register, High Byte             */
    
    struct {
      __IO uint8_t   RC2        :  8;               /*!< [0..7] Reload/Capture Value                                           */
    } bit;                                          /*!< [8] BitSize                                                           */
  } RC2H;
  __I  uint8_t   RESERVED3[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48004010) Timer 2, Low Byte                                      */
    
    struct {
      __IO uint8_t   T2L        :  8;               /*!< [0..7] Timer 2 Value                                                  */
    } bit;                                          /*!< [8] BitSize                                                           */
  } T2L;
  __I  uint8_t   RESERVED4[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48004014) Timer 2, High Byte                                     */
    
    struct {
      __IO uint8_t   T2H        :  8;               /*!< [0..7] Timer 2 Value                                                  */
    } bit;                                          /*!< [8] BitSize                                                           */
  } T2H;
  __I  uint8_t   RESERVED5[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48004018) Timer 2 Control Register 1                             */
    
    struct {
      __IO uint8_t   EXF2EN     :  1;               /*!< [0..0] External Interrupt Enable                                      */
      __IO uint8_t   TF2EN      :  1;               /*!< [1..1] Overflow/Underflow Interrupt Enable                            */
    } bit;                                          /*!< [2] BitSize                                                           */
  } T2CON1;
  __I  uint8_t   RESERVED6[3];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x4800401C) Timer 2 Interrupt Clear Register                       */
    
    struct {
           uint8_t              :  6;
      __O  uint8_t   EXF2CLR    :  1;               /*!< [6..6] External Interrupt Clear Flag                                  */
      __O  uint8_t   TF2CLR     :  1;               /*!< [7..7] Overflow/Underflow Interrupt Clear Flag                        */
    } bit;                                          /*!< [8] BitSize                                                           */
  } T2ICLR;
} TIMER2x_Type;


/* ================================================================================ */
/* ================                      CCU6                      ================ */
/* ================================================================================ */


/**
  * @brief CCU6 (CCU6)
  */

typedef struct {                                    /*!< (@ 0x4000C000) CCU6 Structure                                         */
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4000C000) Capture/Compare Register for Channel CC63              */
    
    struct {
      __I  uint16_t  CCV        : 16;               /*!< [0..15] Channel CC63 Compare Value                                    */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC63R;
  __I  uint16_t  RESERVED0;
  
  union {
    __O  uint16_t  reg;                             /*!< (@ 0x4000C004) Timer Control Register 4                               */
    
    struct {
      __O  uint16_t  T12RR      :  1;               /*!< [0..0] Timer T12 Run Reset                                            */
      __O  uint16_t  T12RS      :  1;               /*!< [1..1] Timer T12 Run Set                                              */
      __O  uint16_t  T12RES     :  1;               /*!< [2..2] Timer T12 Reset                                                */
      __O  uint16_t  DTRES      :  1;               /*!< [3..3] Dead-Time Counter Reset                                        */
           uint16_t             :  1;
      __O  uint16_t  T12CNT     :  1;               /*!< [5..5] Timer T12 Count Event                                          */
      __O  uint16_t  T12STR     :  1;               /*!< [6..6] Timer T12 Shadow Transfer Request                              */
      __O  uint16_t  T12STD     :  1;               /*!< [7..7] Timer T12 Shadow Transfer Disable                              */
      __O  uint16_t  T13RR      :  1;               /*!< [8..8] Timer T13 Run Reset                                            */
      __O  uint16_t  T13RS      :  1;               /*!< [9..9] Timer T13 Run Set                                              */
      __O  uint16_t  T13RES     :  1;               /*!< [10..10] Timer T13 Reset                                              */
           uint16_t             :  2;
      __O  uint16_t  T13CNT     :  1;               /*!< [13..13] Timer T13 Count Event                                        */
      __O  uint16_t  T13STR     :  1;               /*!< [14..14] Timer T13 Shadow Transfer Request                            */
      __O  uint16_t  T13STD     :  1;               /*!< [15..15] Timer T13 Shadow Transfer Disable                            */
    } bit;                                          /*!< [16] BitSize                                                          */
  } TCTR4;
  __I  uint16_t  RESERVED1;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C008) Multi-Channel Mode Output Shadow Register              */
    
