alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint16_t  CCS        : 16;               /*!< [0..15] Shadow Register for Channel x Capture/Compare Value           */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC61SR;
  __I  uint16_t  RESERVED6;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C01C) Capture/Compare Shadow Register for Channel CC62       */
    
    struct {
      __IO uint16_t  CCS        : 16;               /*!< [0..15] Shadow Register for Channel x Capture/Compare Value           */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC62SR;
  __I  uint16_t  RESERVED7;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C020) Capture/Compare Shadow Register for Channel CC63       */
    
    struct {
      __IO uint16_t  CCS        : 16;               /*!< [0..15] Shadow Register for Channel CC63 Compare Value                */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC63SR;
  __I  uint16_t  RESERVED8;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C024) Timer T12 Period Register                              */
    
    struct {
      __IO uint16_t  T12PV      : 16;               /*!< [0..15] T12 Period Value                                              */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T12PR;
  __I  uint16_t  RESERVED9;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C028) Timer T13 Period Register                              */
    
    struct {
      __IO uint16_t  T13PV      : 16;               /*!< [0..15] T13 Period Value                                              */
    } bit;                                          /*!< [16] BitSize                                                          */
  } T13PR;
  __I  uint16_t  RESERVED10;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C02C) Timer T12 Dead-Time Control Register                   */
    
    struct {
      __IO uint16_t  DTM        :  8;               /*!< [0..7] Dead-Time                                                      */
      __IO uint16_t  DTE0       :  1;               /*!< [8..8] Dead-Time Enable Bits                                          */
      __IO uint16_t  DTE1       :  1;               /*!< [9..9] Dead-Time Enable Bits                                          */
      __IO uint16_t  DTE2       :  1;               /*!< [10..10] Dead-Time Enable Bits                                        */
           uint16_t             :  1;
      __I  uint16_t  DTR0       :  1;               /*!< [12..12] Dead-Time Run Indication Bits                                */
      __I  uint16_t  DTR1       :  1;               /*!< [13..13] Dead-Time Run Indication Bits                                */
      __I  uint16_t  DTR2       :  1;               /*!< [14..14] Dead-Time Run Indication Bits                                */
    } bit;                                          /*!< [15] BitSize                                                          */
  } T12DTC;
  __I  uint16_t  RESERVED11;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C030) Timer Control Register 0                               */
    
    struct {
      __IO uint16_t  T12CLK     :  3;               /*!< [0..2] Timer T12 Input Clock Select                                   */
      __IO uint16_t  T12PRE     :  1;               /*!< [3..3] Timer T12 Prescaler Bit                                        */
      __I  uint16_t  T12R       :  1;               /*!< [4..4] Timer T12 Run Bit                                              */
      __I  uint16_t  STE12      :  1;               /*!< [5..5] Timer T12 Shadow Transfer Enable                               */
      __I  uint16_t  CDIR       :  1;               /*!< [6..6] Count Direction of Timer T12                                   */
      __IO uint16_t  CTM        :  1;               /*!< [7..7] T12 Operating Mode                                             */
      __IO uint16_t  T13CLK     :  3;               /*!< [8..10] Timer T13 Input Clock Select                                  */
      __IO uint16_t  T13PRE     :  1;               /*!< [11..11] Timer T13 Prescaler Bit                                      */
      __I  uint16_t  T13R       :  1;               /*!< [12..12] Timer T13 Run Bit                                            */
      __I  uint16_t  STE13      :  1;               /*!< [13..13] Timer T13 Shadow Transfer Enable                             */
    } bit;                                          /*!< [14] BitSize                                                          */
  } TCTR0;
  __I  uint16_t  RESERVED12;
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4000C034) Capture/Compare Register for Channel CC60              */
    
    struct {
      __I  uint16_t  CCV        : 16;               /*!< [0..15] Channel x Capture/Compare Value                               */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC60R;
  __I  uint16_t  RESERVED13;
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4000C038) Capture/Compare Register for Channel CC61              */
    
    struct {
      __I  uint16_t  CCV        : 16;               /*!< [0..15] Channel x Capture/Compare Value                               */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CC61R;
  __I  uint16_t  RESERVED14;
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4000C03C) Capture/Compare Register for Channel CC62              */
    
