alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint16_t  PSL        :  6;               /*!< [0..5] Compare Outputs Passive State Level                            */
           uint16_t             :  1;
      __IO uint16_t  PSL63      :  1;               /*!< [7..7] Passive State Level of Output COUT63                           */
    } bit;                                          /*!< [8] BitSize                                                           */
  } PSLR;
  __I  uint16_t  RESERVED20;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C054) Multi-Channel Mode Control Register                    */
    
    struct {
      __IO uint16_t  SWSEL      :  3;               /*!< [0..2] Switching Selection                                            */
           uint16_t             :  1;
      __IO uint16_t  SWSYN      :  2;               /*!< [4..5] Switching Synchronization                                      */
           uint16_t             :  2;
      __IO uint16_t  STE12U     :  1;               /*!< [8..8] Shadow Transfer Enable for T12 Upcounting                      */
      __IO uint16_t  STE12D     :  1;               /*!< [9..9] Shadow Transfer Enable for T12 Downcounting                    */
      __IO uint16_t  STE13U     :  1;               /*!< [10..10] Shadow Transfer Enable for T13 Upcounting                    */
    } bit;                                          /*!< [11] BitSize                                                          */
  } MCMCTR;
  __I  uint16_t  RESERVED21;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C058) Timer Control Register 2                               */
    
    struct {
      __IO uint16_t  T12SSC     :  1;               /*!< [0..0] Timer T12 Single Shot Control                                  */
      __IO uint16_t  T13SSC     :  1;               /*!< [1..1] Timer T13 Single Shot Control                                  */
      __IO uint16_t  T13TEC     :  3;               /*!< [2..4] T13 Trigger Event Control                                      */
      __IO uint16_t  T13TED     :  2;               /*!< [5..6] Timer T13 Trigger Event Direction                              */
           uint16_t             :  1;
      __IO uint16_t  T12RSEL    :  2;               /*!< [8..9] Timer T12 External Run Selection                               */
      __IO uint16_t  T13RSEL    :  2;               /*!< [10..11] Timer T13 External Run Selection                             */
    } bit;                                          /*!< [12] BitSize                                                          */
  } TCTR2;
  __I  uint16_t  RESERVED22;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C05C) Modulation Control Register                            */
    
    struct {
      __IO uint16_t  T12MODEN   :  6;               /*!< [0..5] T12 Modulation Enable                                          */
           uint16_t             :  1;
      __IO uint16_t  MCMEN      :  1;               /*!< [7..7] Multi-Channel Mode Enable                                      */
      __IO uint16_t  T13MODEN   :  6;               /*!< [8..13] T13 Modulation Enable                                         */
           uint16_t             :  1;
      __IO uint16_t  ECT13O     :  1;               /*!< [15..15] Enable Compare Timer T13 Output                              */
    } bit;                                          /*!< [16] BitSize                                                          */
  } MODCTR;
  __I  uint16_t  RESERVED23;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C060) Trap Control Register                                  */
    
    struct {
      __IO uint16_t  TRPM0      :  1;               /*!< [0..0] Trap Mode Control Bits 1, 0                                    */
      __IO uint16_t  TRPM1      :  1;               /*!< [1..1] Trap Mode Control Bits 1, 0                                    */
      __IO uint16_t  TRPM2      :  1;               /*!< [2..2] Trap Mode Control Bit 2                                        */
           uint16_t             :  5;
      __IO uint16_t  TRPEN      :  6;               /*!< [8..13] Trap Enable Control                                           */
      __IO uint16_t  TRPEN13    :  1;               /*!< [14..14] Trap Enable Control for Timer T13                            */
      __IO uint16_t  TRPPEN     :  1;               /*!< [15..15] Trap Pin Enable                                              */
    } bit;                                          /*!< [16] BitSize                                                          */
  } TRPCTR;
  __I  uint16_t  RESERVED24;
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4000C064) Multi-Channel Mode Output Register                     */
    
    struct {
      __I  uint16_t  MCMP       :  6;               /*!< [0..5] Multi-Channel PWM Pattern                                      */
      __I  uint16_t  R          :  1;               /*!< [6..6] Reminder Flag                                                  */
           uint16_t             :  1;
      __I  uint16_t  EXPH       :  3;               /*!< [8..10] Expected Hall Pattern                                         */
      __I  uint16_t  CURH       :  3;               /*!< [11..13] Current Hall Pattern                                         */
    } bit;                                          /*!< [14] BitSize                                                          */
  } MCMOUT;
  __I  uint16_t  RESERVED25;
  
  union {
    __I  uint16_t  reg;                             /*!< (@ 0x4000C068) Capture/Compare Interrupt Status Register              */
    
    struct {
      __I  uint16_t  ICC60R     :  1;               /*!< [0..0] Capture, Compare-Match Rising Edge Flag (x = 0, 1, 2)          */
      __I  uint16_t  ICC60F     :  1;               /*!< [1..1] Capture, Compare-Match Falling Edge Flag (x = 0, 1, 2)         */
      __I  uint16_t  ICC61R     :  1;               /*!< [2..2] Capture, Compare-Match Rising Edge Flag (x = 0, 1, 2)          */
      __I  uint16_t  ICC61F     :  1;               /*!< [3..3] Capture, Compare-Match Falling Edge Flag (x = 0, 1, 2)         */
      __I  uint16_t  ICC62R     :  1;               /*!< [4..4] Capture, Compare-Match Rising Edge Flag (x = 0, 1, 2)          */
      __I  uint16_t  ICC62F     :  1;               /*!< [5..5] Capture, Compare-Match Falling Edge Flag (x = 0, 1, 2)         */
      __I  uint16_t  T12OM      :  1;               /*!< [6..6] Timer T12 One-Match Flag                                       */
      __I  uint16_t  T12PM      :  1;               /*!< [7..7] Timer T12 Period-Match Flag                                    */
      __I  uint16_t  T13CM      :  1;               /*!< [8..8] Timer T13 Compare-Match Flag                                   */
      __I  uint16_t  T13PM      :  1;               /*!< [9..9] Timer T13 Period-Match Flag                                    */
      __I  uint16_t  TRPF       :  1;               /*!< [10..10] Trap Flag                                                    */
      __I  uint16_t  TRPS       :  1;               /*!< [11..11] Trap State                                                   */
      __I  uint16_t  CHE        :  1;               /*!< [12..12] Correct Hall Event                                           */
      __I  uint16_t  WHE        :  1;               /*!< [13..13] Wrong Hall Event                                             */
      __I  uint16_t  IDLE       :  1;               /*!< [14..14] IDLE State                                                   */
      __I  uint16_t  STR        :  1;               /*!< [15..15] Multi-Channel Mode Shadow Transfer Request                   */
    } bit;                                          /*!< [16] BitSize                                                          */
  } IS;
  __I  uint16_t  RESERVED26;
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x4000C06C) Port Input Select Register 0                           */
    
