alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint8_t   RI         :  1;               /*!< [0..0] Receive Interrupt Flag                                         */
      __IO uint8_t   TI         :  1;               /*!< [1..1] Transmit Interrupt Flag                                        */
      __IO uint8_t   RB8        :  1;               /*!< [2..2] Serial Port Receiver Bit 9                                     */
      __IO uint8_t   TB8        :  1;               /*!< [3..3] Serial Port Transmitter Bit 9                                  */
      __IO uint8_t   REN        :  1;               /*!< [4..4] Enable Receiver of Serial Port                                 */
      __IO uint8_t   SM2        :  1;               /*!< [5..5] Enable Serial Port Multiprocessor Communication in Modes
                                                         2 and 3                                                               */
      __IO uint8_t   SM1        :  1;               /*!< [6..6] Serial Port Operating Mode Selection                           */
      __IO uint8_t   SM0        :  1;               /*!< [7..7] Serial Port Operating Mode Selection                           */
    } bit;                                          /*!< [8] BitSize                                                           */
  } SCON;
  __I  uint8_t   RESERVED0[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x48022004) Serial Data Buffer                                     */
    
    struct {
      __IO uint8_t   VAL        :  8;               /*!< [0..7] Serial Interface Buffer Register                               */
    } bit;                                          /*!< [8] BitSize                                                           */
  } SBUF;
  __I  uint8_t   RESERVED1[3];
  
  union {
    __O  uint8_t   reg;                             /*!< (@ 0x48022008) Serial Channel Control Clear Register                  */
    
    struct {
      __O  uint8_t   RICLR      :  1;               /*!< [0..0] Receive Interrupt Clear Flag                                   */
      __O  uint8_t   TICLR      :  1;               /*!< [1..1] Transmit Interrupt Clear Flag                                  */
    } bit;                                          /*!< [2] BitSize                                                           */
  } SCONCLR;
} UART_Type;



/* ================================================================================ */
/* ================                      SSCx                      ================ */
/* ================================================================================ */


/**
  * @brief SSCx (SSCx)
  */

typedef struct {                                    /*!< (@ 0x48026000) SSC2 Structure                                         */
  
  union {
    __IO uint16_t  reg;                             /*!< (@ 0x48026000) Port Input Select Register, RESET_TYPE_3               */
    
    struct {
      __IO uint16_t  MIS_0      :  1;               /*!< [0..0] Master Mode Receiver Input Select: 0b0=see (SSC1)., 0b1=see
                                                         (SSC1)., 0b0=Receiver input (Port A: P1.2) is selected (SSC2).,
                                                          0b1=Receiver input (Port B: P2.5) is selected (SSC2).,               */
      __IO uint16_t  SIS        :  1;               /*!< [1..1] Slave Mode Receiver Input Select: 0b0=Receiver input
                                                         (Port A: P0.2) is selected (SSC1)., 0b1=Receiver input (Port
                                                          B: P0.2) is selected (SSC1)., 0b0=Receiver input (Port A: P1.1)
                                                          is selected (SSC2)., 0b1=Receiver input (Port B: P1.1) is selected
                                                          (SSC2).,                                                             */
      __IO uint16_t  CIS        :  1;               /*!< [2..2] Slave Mode Clock Input Select: 0b0=Clock input (Port
                                                         A: P0.3) is selected (SSC1)., 0b1=Clock input (Port B: P0.3)
                                                          is selected (SSC1)., 0b0=Clock input (Port A: P1.0) is selected
                                                          (SSC2)., 0b1=Clock input (Port B: P1.0) is selected (SSC2).,
                                                                                                                               */
      __IO uint16_t  MIS_1      :  1;               /*!< [3..3] Master Mode Receiver Input Select: 0b0=see (SSC1)., 0b1=see
                                                         (SSC1)., 0b0=n/a (SSC2)., 0b1=n/a (SSC2).,                            */
    } bit;                                          /*!< [4] BitSize                                                           */
  } PISEL;
  __I  uint16_t  RESERVED0;
  
	union {
	  __IO uint16_t  reg;                           /*!< (@ 0x48026004) Control Register                                       */
	  
	  struct {
	    __I  uint16_t  BC       :  4;               /*!< [0..3] Bit Count Field                                                */
	         uint16_t           :  4;
	    __IO uint16_t  TE       :  1;               /*!< [8..8] Transmit Error Flag                                            */
	    __IO uint16_t  RE       :  1;               /*!< [9..9] Receive Error Flag                                             */
	    __IO uint16_t  PE       :  1;               /*!< [10..10] Phase Error Flag                                             */
	    __IO uint16_t  BE       :  1;               /*!< [11..11] Baud Rate Error Flag                                         */
	    __I  uint16_t  BSY      :  1;               /*!< [12..12] Busy Flag                                                    */
	         uint16_t           :  1;
	    __IO uint16_t  MS       :  1;               /*!< [14..14] Master Select Bit                                            */
	    __IO uint16_t  EN       :  1;               /*!< [15..15] Enable Bit = 1                                               */
	  } RUN_bit;                                    /*!< [16] BitSize                                                          */
	
