alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint8_t   ENABLE     :  1;               /*!< [0..0] VDDEXT Supply Enable                                           */
      __IO uint8_t   CYC_EN     :  1;               /*!< [1..1] VDDEXT Supply for Cyclic Sense Enable                          */
      __IO uint8_t   FAIL_EN    :  1;               /*!< [2..2] Enabling of VDDEXT Supply status information as interrupt
                                                         source                                                                */
      __IO uint8_t   SHORT      :  1;               /*!< [3..3] VDDEXT Supply Shorted Output                                   */
      __IO uint8_t   OVERVOLT   :  1;               /*!< [4..4] VDDEXT Supply Overvoltage                                      */
      __IO uint8_t   OVERLOAD   :  1;               /*!< [5..5] VDDEXT Supply Overload                                         */
      __I  uint8_t   OK         :  1;               /*!< [6..6] VDDEXT Supply works inside its specified range 2               */
      __I  uint8_t   STABLE     :  1;               /*!< [7..7] VDDEXT Supply works inside its specified range 1               */
    } bit;                                          /*!< [8] BitSize                                                           */
  } VDDEXT_CTRL;
  __I  uint8_t   RESERVED2[7];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50004010) Reset Status Hard Register                             */
    
    struct {
      __IO uint8_t   SYS_FAIL   :  1;               /*!< [0..0] Flag which indicates a reset caused by a System Fail
                                                         reported in the corresponding Fail Register                           */
      __IO uint8_t   PMU_WAKE   :  1;               /*!< [1..1] Flag which indicates a reset caused by Stop-Exit               */
      __IO uint8_t   PMU_SleepEX:  1;               /*!< [2..2] Flag which indicates a reset caused by Sleep-Exit              */
      __IO uint8_t   PMU_LPR    :  1;               /*!< [3..3] Low Priority Resets (see PMU_RESET_STS2)                       */
      __IO uint8_t   PMU_ClkWDT :  1;               /*!< [4..4] Clock Watchdog (CLKWDT) Reset Flag                             */
      __IO uint8_t   PMU_ExtWDT :  1;               /*!< [5..5] External Watchdog (WDT1) Reset Flag                            */
      __IO uint8_t   PMU_PIN    :  1;               /*!< [6..6] PIN-Reset Flag                                                 */
      __IO uint8_t   PMU_1V5DidPOR:  1;             /*!< [7..7] Power-On Reset Flag                                            */
    } bit;                                          /*!< [8] BitSize                                                           */
  } PMU_RESET_STS1;
  __I  uint8_t   RESERVED3[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50004014) Reset Status Soft Register                             */
    
    struct {
      __IO uint8_t   PMU_IntWDT :  1;               /*!< [0..0] Internal Watchdog Reset Flag                                   */
      __IO uint8_t   PMU_SOFT   :  1;               /*!< [1..1] Soft-Reset Flag                                                */
      __IO uint8_t   LOCKUP     :  1;               /*!< [2..2] Lockup-Reset Flag                                              */
    } bit;                                          /*!< [3] BitSize                                                           */
  } PMU_RESET_STS2;
  __I  uint8_t   RESERVED4[11];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50004020) PMU Settings Register                                  */
    
    struct {
      __IO uint8_t   WAKE_W_RST :  1;               /*!< [0..0] Wake-up with reset execution                                   */
      __IO uint8_t   EN_0V9_N   :  1;               /*!< [1..1] Disables the reduction of the VDDC regulator output to
                                                         0.9 V during Stop-Mode                                                */
      __IO uint8_t   CYC_WAKE_EN:  1;               /*!< [2..2] Enabling Cyclic Wake                                           */
      __IO uint8_t   CYC_SENSE_EN:  1;              /*!< [3..3] Enabling Cyclic Sense                                          */
           uint8_t              :  3;
      __IO uint8_t   EN_VDDEXT_OC_OFF_N:  1;        /*!< [7..7] Disabling VDDEXT Shutdown in Overload Condition                */
    } bit;                                          /*!< [8] BitSize                                                           */
  } CNF_PMU_SETTINGS;
  __I  uint8_t   RESERVED5[7];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50004028) Dead Time in Cyclic Sense Register                     */
    
    struct {
      __IO uint8_t   M03        :  4;               /*!< [0..3] Mantissa                                                       */
      __IO uint8_t   E01        :  2;               /*!< [4..5] Exponent                                                       */
           uint8_t              :  1;
      __IO uint8_t   OSC_100kHz_EN:  1;             /*!< [7..7] 100 kHz Oscillator Enable                                      */
    } bit;                                          /*!< [8] BitSize                                                           */
  } CNF_CYC_SENSE;
  __I  uint8_t   RESERVED6[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x5000402C) Dead Time in Cyclic Wake Register                      */
    
    struct {
      __IO uint8_t   M03        :  4;               /*!< [0..3] Mantissa                                                       */
      __IO uint8_t   E01        :  2;               /*!< [4..5] Exponent                                                       */
    } bit;                                          /*!< [6] BitSize                                                           */
  } CNF_CYC_WAKE;
  __I  uint8_t   RESERVED7[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50004030) Sample Delay in Cyclic Sense Register                  */
    
