alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint8_t   M03        :  4;               /*!< [0..3] Mantissa                                                       */
    } bit;                                          /*!< [4] BitSize                                                           */
  } CNF_CYC_SAMPLE_DEL;
  __I  uint8_t   RESERVED8[31];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50004050) LIN Wake Enable                                        */
    
    struct {
           uint8_t              :  7;
      __IO uint8_t   LIN_EN     :  1;               /*!< [7..7] Lin Wake enable                                                */
    } bit;                                          /*!< [8] BitSize                                                           */
  } LIN_WAKE_EN;
  __I  uint8_t   RESERVED9[27];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x5000406C) Reset Blind Time Register                              */
    
    struct {
      __IO uint8_t   RST_TFB    :  2;               /*!< [0..1] Reset Pin Blind Time Selection Bits                            */
    } bit;                                          /*!< [2] BitSize                                                           */
  } CNF_RST_TFB;
  __I  uint8_t   RESERVED10[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50004070) System Fail Status Register                            */
    
    struct {
      __IO uint8_t   SUPP_SHORT :  1;               /*!< [0..0] Supply Short                                                   */
      __IO uint8_t   SUPP_TMOUT :  1;               /*!< [1..1] Supply Time Out                                                */
      __IO uint8_t   PMU_1V5_OVL:  1;               /*!< [2..2] VDDC Overload Flag                                             */
      __IO uint8_t   PMU_5V_OVL :  1;               /*!< [3..3] VDDP Overload Flag                                             */
           uint8_t              :  1;
      __IO uint8_t   SYS_OT     :  1;               /*!< [5..5] System Overtemperature Indication Flag                         */
      __IO uint8_t   WDT1_SEQ_FAIL:  1;             /*!< [6..6] External Watchdog (WDT1) Sequential Fail                       */
    } bit;                                          /*!< [7] BitSize                                                           */
  } SYS_FAIL_STS;
  __I  uint8_t   RESERVED11[15];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50004080) Wake Status Fail Register                              */
    
    struct {
      __IO uint8_t   SUPPFAIL   :  1;               /*!< [0..0] Stop-Exit due to overvoltage at the VDDEXT Supply              */
           uint8_t              :  1;
      __IO uint8_t   VDDEXTSHORT:  1;               /*!< [2..2] Stop-Exit due to short circuit at the VDDEXT Supply            */
    } bit;                                          /*!< [3] BitSize                                                           */
  } WAKE_STS_FAIL;
  __I  uint8_t   RESERVED12[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50004084) Wake Source MON Input Register                         */
    
    struct {
      __I  uint8_t   WAKE_STS   :  1;               /*!< [0..0] Status of MON                                                  */
    } bit;                                          /*!< [1] BitSize                                                           */
  } WAKE_STS_MON;
  __I  uint8_t   RESERVED13[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x50004088) Wake Status GPIO 0 Register                            */
    
    struct {
      __I  uint8_t   GPIO0_STS_0:  1;               /*!< [0..0] Status of GPIO0_0                                              */
      __I  uint8_t   GPIO0_STS_1:  1;               /*!< [1..1] Status of GPIO0_1                                              */
      __I  uint8_t   GPIO0_STS_2:  1;               /*!< [2..2] Status of GPIO0_2                                              */
      __I  uint8_t   GPIO0_STS_3:  1;               /*!< [3..3] Status of GPIO0_3                                              */
      __I  uint8_t   GPIO0_STS_4:  1;               /*!< [4..4] Status of GPIO0_4                                              */
    } bit;                                          /*!< [5] BitSize                                                           */
  } WAKE_STS_GPIO0;
  __I  uint8_t   RESERVED14[3];
  
  union {
    __I  uint8_t   reg;                             /*!< (@ 0x5000408C) Wake Status GPIO 1 Register                            */
    
    struct {
      __I  uint8_t   GPIO1_STS_0:  1;               /*!< [0..0] Wake GPIO1_0                                                   */
      __I  uint8_t   GPIO1_STS_1:  1;               /*!< [1..1] Wake GPIO1_1                                                   */
      __I  uint8_t   GPIO1_STS_2:  1;               /*!< [2..2] Wake GPIO1_2                                                   */
      __I  uint8_t   GPIO1_STS_3:  1;               /*!< [3..3] Wake GPIO1_3                                                   */
      __I  uint8_t   GPIO1_STS_4:  1;               /*!< [4..4] Wake GPIO1_4                                                   */
    } bit;                                          /*!< [5] BitSize                                                           */
  } WAKE_STS_GPIO1;
  __I  uint8_t   RESERVED15[31];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040AC) PMU Wake-up Timing Register                            */
    
    struct {
      __IO uint8_t   CNF_LIN_FT :  1;               /*!< [0..0] Wake-up Filter time for LIN WAKE                               */
      __IO uint8_t   CNF_MON_FT :  1;               /*!< [1..1] Wake-up Filter time for Monitoring Inputs                      */
      __IO uint8_t   CNF_GPIO_FT:  2;               /*!< [2..3] Wake-up Filter time for General Purpose IO                     */
    } bit;                                          /*!< [4] BitSize                                                           */
  } CNF_WAKE_FILTER;
  __I  uint8_t   RESERVED16[19];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040C0) General Purpose User DATA0                             */
    
