alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint8_t   DATA0      :  8;               /*!< [0..7] DATA0 Storage Byte                                             */
    } bit;                                          /*!< [8] BitSize                                                           */
  } GPUDATA00;
  __I  uint8_t   RESERVED17[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040C4) General Purpose User DATA1                             */
    
    struct {
      __IO uint8_t   DATA1      :  8;               /*!< [0..7] DATA1 Storage Byte                                             */
    } bit;                                          /*!< [8] BitSize                                                           */
  } GPUDATA01;
  __I  uint8_t   RESERVED18[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040C8) General Purpose User DATA2                             */
    
    struct {
      __IO uint8_t   DATA2      :  8;               /*!< [0..7] DATA2 Storage Byte                                             */
    } bit;                                          /*!< [8] BitSize                                                           */
  } GPUDATA02;
  __I  uint8_t   RESERVED19[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040CC) General Purpose User DATA3                             */
    
    struct {
      __IO uint8_t   DATA3      :  8;               /*!< [0..7] DATA3 Storage Byte                                             */
    } bit;                                          /*!< [8] BitSize                                                           */
  } GPUDATA03;
  __I  uint8_t   RESERVED20[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040D0) General Purpose User DATA4                             */
    
    struct {
      __IO uint8_t   DATA4      :  8;               /*!< [0..7] DATA4 Storage Byte                                             */
    } bit;                                          /*!< [8] BitSize                                                           */
  } GPUDATA04;
  __I  uint8_t   RESERVED21[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040D4) General Purpose User DATA5                             */
    
    struct {
      __IO uint8_t   DATA5      :  8;               /*!< [0..7] DATA5 Storage Byte                                             */
    } bit;                                          /*!< [8] BitSize                                                           */
  } GPUDATA05;
  __I  uint8_t   RESERVED22[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040D8) Wake Configuration GPIO Port 0 Rising Edge Register    */
    
    struct {
      __IO uint8_t   GPIO0_RI_0 :  1;               /*!< [0..0] Port 0_0 Wake-up on Rising Edge enable                         */
      __IO uint8_t   GPIO0_RI_1 :  1;               /*!< [1..1] Port 0_1 Wake-up on Rising Edge enable                         */
      __IO uint8_t   GPIO0_RI_2 :  1;               /*!< [2..2] Port 0_2 Wake-up on Rising Edge enable                         */
      __IO uint8_t   GPIO0_RI_3 :  1;               /*!< [3..3] Port 0_3 Wake-up on Rising Edge enable                         */
      __IO uint8_t   GPIO0_RI_4 :  1;               /*!< [4..4] Port 0_4 Wake-up on Rising Edge enable                         */
    } bit;                                          /*!< [5] BitSize                                                           */
  } WAKE_CONF_GPIO0_RISE;
  __I  uint8_t   RESERVED23[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040DC) Wake Configuration GPIO Port 0 Falling Edge Register   */
    
    struct {
      __IO uint8_t   GPIO0_FA_0 :  1;               /*!< [0..0] Port 0_0 Wake-up on Falling Edge enable                        */
      __IO uint8_t   GPIO0_FA_1 :  1;               /*!< [1..1] Port 0_1 Wake-up on Falling Edge enable                        */
      __IO uint8_t   GPIO0_FA_2 :  1;               /*!< [2..2] Port 0_2 Wake-up on Falling Edge enable                        */
      __IO uint8_t   GPIO0_FA_3 :  1;               /*!< [3..3] Port 0_3 Wake-up on Falling Edge enable                        */
      __IO uint8_t   GPIO0_FA_4 :  1;               /*!< [4..4] Port 0_4 Wake-up on Falling Edge enable                        */
    } bit;                                          /*!< [5] BitSize                                                           */
  } WAKE_CONF_GPIO0_FALL;
  __I  uint8_t   RESERVED24[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040E0) Wake Port 0 Cycle Enabled Register                     */
    
    struct {
      __IO uint8_t   GPIO0_CYC_0:  1;               /*!< [0..0] GPIO0_0 input for cycle sense enable                           */
      __IO uint8_t   GPIO0_CYC_1:  1;               /*!< [1..1] GPIO0_1 input for cycle sense enable                           */
      __IO uint8_t   GPIO0_CYC_2:  1;               /*!< [2..2] GPIO0_2 input for cycle sense enable                           */
      __IO uint8_t   GPIO0_CYC_3:  1;               /*!< [3..3] GPIO0_3 input for cycle sense enable                           */
      __IO uint8_t   GPIO0_CYC_4:  1;               /*!< [4..4] GPIO0_4 input for cycle sense enable                           */
    } bit;                                          /*!< [5] BitSize                                                           */
  } WAKE_CONF_GPIO0_CYC;
  __I  uint8_t   RESERVED25[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040E4) Wake Configuration GPIO Port 1 Rising Edge Register    */
    
    struct {
      __IO uint8_t   GPIO1_RI_0 :  1;               /*!< [0..0] Port 1_0 Wake-up on Rising Edge enable                         */
      __IO uint8_t   GPIO1_RI_1 :  1;               /*!< [1..1] Port 1_1 Wake-up on Rising Edge enable                         */
      __IO uint8_t   GPIO1_RI_2 :  1;               /*!< [2..2] Port 1_2 Wake-up on Rising Edge enable                         */
      __IO uint8_t   GPIO1_RI_3 :  1;               /*!< [3..3] Port 1_3 Wake-up on Rising Edge enable                         */
      __IO uint8_t   GPIO1_RI_4 :  1;               /*!< [4..4] Port 1_4 Wake-up on Rising Edge enable                         */
    } bit;                                          /*!< [5] BitSize                                                           */
  } WAKE_CONF_GPIO1_RISE;
  __I  uint8_t   RESERVED26[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040E8) Wake Configuration GPIO Port 1 Falling Edge Register   */
    
