alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint8_t   GPIO1_FA_0 :  1;               /*!< [0..0] Port 1_0 Wake-up on Falling Edge enable                        */
      __IO uint8_t   GPIO1_FA_1 :  1;               /*!< [1..1] Port 1_1 Wake-up on Falling Edge enable                        */
      __IO uint8_t   GPIO1_FA_2 :  1;               /*!< [2..2] Port 1_2 Wake-up on Falling Edge enable                        */
      __IO uint8_t   GPIO1_FA_3 :  1;               /*!< [3..3] Port 1_3 Wake-up on Falling Edge enable                        */
      __IO uint8_t   GPIO1_FA_4 :  1;               /*!< [4..4] Port 1_4 Wake-up on Falling Edge enable                        */
    } bit;                                          /*!< [5] BitSize                                                           */
  } WAKE_CONF_GPIO1_FALL;
  __I  uint8_t   RESERVED27[3];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500040EC) Wake Port 1 Cycle Enabled Register                     */
    
    struct {
      __IO uint8_t   GPIO1_CYC_0:  1;               /*!< [0..0] GPIO1_0 input for cycle sense enable                           */
      __IO uint8_t   GPIO1_CYC_1:  1;               /*!< [1..1] GPIO1_1 input for cycle sense enable                           */
      __IO uint8_t   GPIO1_CYC_2:  1;               /*!< [2..2] GPIO1_2 input for cycle sense enable                           */
      __IO uint8_t   GPIO1_CYC_3:  1;               /*!< [3..3] GPIO1_3 input for cycle sense enable                           */
      __IO uint8_t   GPIO1_CYC_4:  1;               /*!< [4..4] GPIO1_4 input for cycle sense enable                           */
    } bit;                                          /*!< [5] BitSize                                                           */
  } WAKE_CONF_GPIO1_CYC;
  __I  uint8_t   RESERVED28[487];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x500042D4) System Startup Config                                  */
    
    struct {
      __IO uint8_t   MBIST_EN   :  1;               /*!< [0..0] System Startup Configuration Bit for RAM MBIST at Sleep
                                                         Mode exit                                                             */
    } bit;                                          /*!< [1] BitSize                                                           */
  } SystemStartConfig;
} PMU_Type;


/* ================================================================================ */
/* ================                      SCUPM                     ================ */
/* ================================================================================ */


/**
  * @brief SCUPM (SCUPM)
  */

typedef struct {                                    /*!< (@ 0x50006000) SCUPM Structure                                        */
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50006000) Analog Module Clock Frequency Status Register          */
    
    struct {
      __I  uint32_t  AMCLK1_FREQ:  6;               /*!< [0..5] Current frequency of Analog Module Clock System Clock
                                                         (MI_CLK)                                                              */
           uint32_t             :  2;
      __I  uint32_t  AMCLK2_FREQ:  6;               /*!< [8..13] Current frequency of Analog Module Clock 2 (TFILT_CLK)        */
    } bit;                                          /*!< [14] BitSize                                                          */
  } AMCLK_FREQ_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006004) Analog Module Clock Control                            */
    
    struct {
      __IO uint32_t  CLKWDT_PD_N:  1;               /*!< [0..0] Clock Watchdog Powerdown                                       */
    } bit;                                          /*!< [1] BitSize                                                           */
  } AMCLK_CTRL;
  __I  uint32_t  RESERVED0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000600C) Analog Module Clock Limit Register                     */
    
    struct {
      __IO uint32_t  AMCLK1_UP_TH:  6;              /*!< [0..5] Analog Module Clock 1 (MI_CLK) Upper Limit Threshold           */
      __IO uint32_t  AMCLK1_UP_HYS:  2;             /*!< [6..7] Analog Module Clock 1 (MI_CLK) Upper Hysteresis                */
      __IO uint32_t  AMCLK1_LOW_TH:  6;             /*!< [8..13] Analog Module Clock 1 (MI_CLK) Lower Limit Threshold          */
      __IO uint32_t  AMCLK1_LOW_HYS:  2;            /*!< [14..15] Analog Module Clock 1 (MI_CLK) Lower Hysteresis              */
      __IO uint32_t  AMCLK2_UP_TH:  6;              /*!< [16..21] Analog Module Clock 2 (TFILT_CLK) Upper Limit Threshold      */
      __IO uint32_t  AMCLK2_UP_HYS:  2;             /*!< [22..23] Analog Module Clock 2 (TFILT_CLK) Upper Hysteresis           */
      __IO uint32_t  AMCLK2_LOW_TH:  6;             /*!< [24..29] Analog Module Clock 2 (TFILT_CLK) Lower Limit Threshold      */
      __IO uint32_t  AMCLK2_LOW_HYS:  2;            /*!< [30..31] Analog Module Clock 2 (TFILT_CLK) Lower Hysteresis           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } AMCLK_TH_HYS;
  __I  uint32_t  RESERVED1;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50006014) System Interrupt Status Clear                          */
    
    struct {
      __O  uint32_t  LIN_OC_ICLR:  1;               /*!< [0..0] LIN Overcurrent interrupt status                               */
      __O  uint32_t  LIN_OT_ICLR:  1;               /*!< [1..1] LIN Overtemperature interrupt status                           */
      __O  uint32_t  LIN_TMOUT_ICLR:  1;            /*!< [2..2] LIN TXD timeout                                                */
           uint32_t             :  3;
      __O  uint32_t  PMU_OTWARN_ICLR:  1;           /*!< [6..6] PMU Regulator Overtemperature Prewarning (ADC2, Channel
                                                         9) interrupt status                                                   */
      __O  uint32_t  PMU_OT_ICLR:  1;               /*!< [7..7] PMU Regulator Overtemperature Shutdown (ADC2, Channel
                                                         9) interrupt status                                                   */
      __O  uint32_t  SYS_OTWARN_ICLR:  1;           /*!< [8..8] System Overtemperature Prewarning (ADC2, Channel 8) interrupt
                                                         status                                                                */
      __O  uint32_t  SYS_OT_ICLR:  1;               /*!< [9..9] System Overtemperature Shutdown (ADC2, Channel 8) interrupt
                                                         status                                                                */
      __O  uint32_t  REFBG_LOTHWARN_ICLR:  1;       /*!< [10..10] 8 Bit ADC2 Reference Undervoltage (ADC2, Channel 5)
                                                         interrupt status                                                      */
      __O  uint32_t  REFBG_UPTHWARN_ICLR:  1;       /*!< [11..11] 8 Bit ADC2 Reference Overvoltage (ADC2, Channel 5)
                                                         interrupt status                                                      */
      __O  uint32_t  VREF5V_LOWTH_ICLR:  1;         /*!< [12..12] VREF5V ADC1 Reference Undervoltage (ADC2, Channel 4)
                                                         Interrupt Status                                                      */
      __O  uint32_t  VREF5V_UPTH_ICLR:  1;          /*!< [13..13] VREF5V ADC1 Reference Overvoltage (ADC2, Channel 4)
                                                         Interrupt Status                                                      */
      __O  uint32_t  VREF5V_OVL_ICLR:  1;           /*!< [14..14] VREF5V Overload Interrupt Status                             */
      __O  uint32_t  ADC2_ESM_ICLR:  1;             /*!< [15..15] ADC2 Exceptional Sequence Measurement Interrupt Status       */
    } bit;                                          /*!< [16] BitSize                                                          */
  } SYS_ISCLR;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50006018) System Interrupt Status                                */
    
