alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __I  uint32_t  LIN_OC_IS  :  1;               /*!< [0..0] LIN Overcurrent interrupt status                               */
      __I  uint32_t  LIN_OT_IS  :  1;               /*!< [1..1] LIN Overtemperature interrupt status                           */
      __I  uint32_t  LIN_TMOUT_IS:  1;              /*!< [2..2] LIN TXD timeout                                                */
           uint32_t             :  3;
      __I  uint32_t  PMU_OTWARN_IS:  1;             /*!< [6..6] PMU Regulator Overtemperature Prewarning (ADC2, Channel
                                                         9) interrupt status                                                   */
      __I  uint32_t  PMU_OT_IS  :  1;               /*!< [7..7] PMU Regulator Overtemperature Shutdown (ADC2, Channel
                                                         9) interrupt status                                                   */
      __I  uint32_t  SYS_OTWARN_IS:  1;             /*!< [8..8] System Overtemperature Prewarning (ADC2, Channel 8) interrupt
                                                         status                                                                */
      __I  uint32_t  SYS_OT_IS  :  1;               /*!< [9..9] System Overtemperature Shutdown (ADC2, Channel 8) interrupt
                                                         status                                                                */
      __I  uint32_t  REFBG_LOTHWARN_IS:  1;         /*!< [10..10] 8 Bit ADC2 Reference Undervoltage (ADC2, Channel 5)
                                                         interrupt status                                                      */
      __I  uint32_t  REFBG_UPTHWARN_IS:  1;         /*!< [11..11] 8 Bit ADC2 Reference Overvoltage (ADC2, Channel 5)
                                                         interrupt status                                                      */
      __I  uint32_t  VREF5V_LOWTH_IS:  1;           /*!< [12..12] VREF5V ADC1 Reference Undervoltage (ADC2, Channel 4)
                                                         Interrupt Status                                                      */
      __I  uint32_t  VREF5V_UPTH_IS:  1;            /*!< [13..13] VREF5V ADC1 Reference Overvoltage (ADC2, Channel 4)
                                                         Interrupt Status                                                      */
      __I  uint32_t  VREF5V_OVL_IS:  1;             /*!< [14..14] VREF5V Overload Interrupt Status                             */
      __I  uint32_t  ADC2_ESM_IS:  1;               /*!< [15..15] ADC2 Exceptional Sequence Measurement Interrupt Status       */
    } bit;                                          /*!< [16] BitSize                                                          */
  } SYS_IS;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x5000601C) System Supply Interrupt Status                         */
    
    struct {
      __I  uint32_t  VBAT_UV_IS :  1;               /*!< [0..0] VBAT Undervoltage Interrupt Status (ADC2 channel 0)            */
      __I  uint32_t  VS_UV_IS   :  1;               /*!< [1..1] VS Undervoltage Interrupt Status (ADC2 channel 1)              */
      __I  uint32_t  VDD5V_UV_IS:  1;               /*!< [2..2] VDDP Undervoltage Interrupt Status (ADC2 channel 2)            */
      __I  uint32_t  VDD1V5_UV_IS:  1;              /*!< [3..3] VDDC Undervoltage Interrupt Status (ADC2 channel 3)            */
      __I  uint32_t  VBAT_OV_IS :  1;               /*!< [4..4] VBAT Overvoltage Interrupt Status (ADC2 channel 0)             */
      __I  uint32_t  VS_OV_IS   :  1;               /*!< [5..5] VS Overvoltage Interrupt Status (ADC2 channel 1)               */
      __I  uint32_t  VDD5V_OV_IS:  1;               /*!< [6..6] VDDP Overvoltage Interrupt Status (ADC2 channel 2)             */
      __I  uint32_t  VDD1V5_OV_IS:  1;              /*!< [7..7] VDDC Overvoltage Interrupt Status (ADC2 channel 3)             */
           uint32_t             :  8;
      __I  uint32_t  VBAT_UV_STS:  1;               /*!< [16..16] VBAT Undervoltage Status                                     */
      __I  uint32_t  VS_UV_STS  :  1;               /*!< [17..17] VS Undervoltage Status                                       */
      __I  uint32_t  VDD5V_UV_STS:  1;              /*!< [18..18] VDDP Undervoltage Status                                     */
      __I  uint32_t  VDD1V5_UV_STS:  1;             /*!< [19..19] VDDC Undervoltage Status                                     */
      __I  uint32_t  VBAT_OV_STS:  1;               /*!< [20..20] VBAT Overvoltage Status                                      */
      __I  uint32_t  VS_OV_STS  :  1;               /*!< [21..21] VS Overvoltage Interrupt Status                              */
      __I  uint32_t  VDD5V_OV_STS:  1;              /*!< [22..22] VDDP Overvoltage Status                                      */
      __I  uint32_t  VDD1V5_OV_STS:  1;             /*!< [23..23] VDDC Overvoltage Status                                      */
    } bit;                                          /*!< [24] BitSize                                                          */
  } SYS_SUPPLY_IRQ_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006020) System Supply Interrupt Control                        */
    
    struct {
      __IO uint32_t  VBAT_UV_IE :  1;               /*!< [0..0] VBAT Undervoltage Interrupt Enable                             */
      __IO uint32_t  VS_UV_IE   :  1;               /*!< [1..1] VS Undervoltage Interrupt Enable                               */
      __IO uint32_t  VDD5V_UV_IE:  1;               /*!< [2..2] VDD5V Undervoltage Interrupt Enable                            */
      __IO uint32_t  VDD1V5_UV_IE:  1;              /*!< [3..3] VDD1V5 Undervoltage Interrupt Enable                           */
      __IO uint32_t  VBAT_OV_IE :  1;               /*!< [4..4] VBAT Overvoltage Interrupt Enable                              */
      __IO uint32_t  VS_OV_IE   :  1;               /*!< [5..5] VS Overvoltage Interrupt Enable                                */
      __IO uint32_t  VDD5V_OV_IE:  1;               /*!< [6..6] VDD5V Overvoltage Interrupt Enable                             */
      __IO uint32_t  VDD1V5_OV_IE:  1;              /*!< [7..7] VDD1V5 Overvoltage Interrupt Enable                            */
    } bit;                                          /*!< [8] BitSize                                                           */
  } SYS_SUPPLY_IRQ_CTRL;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50006024) System Supply Interrupt Status Clear                   */
    
