alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __O  uint32_t  VBAT_UV_ICLR:  1;              /*!< [0..0] VBAT Undervoltage Interrupt Status (ADC2 channel 0)            */
      __O  uint32_t  VS_UV_ICLR :  1;               /*!< [1..1] VS Undervoltage Interrupt Status (ADC2 channel 1)              */
      __O  uint32_t  VDD5V_UV_ICLR:  1;             /*!< [2..2] VDDP Undervoltage Interrupt Status (ADC2 channel 2)            */
      __O  uint32_t  VDD1V5_UV_ICLR:  1;            /*!< [3..3] VDDC Undervoltage Interrupt Status (ADC2 channel 3)            */
      __O  uint32_t  VBAT_OV_ICLR:  1;              /*!< [4..4] VBAT Overvoltage Interrupt Status (ADC2 channel 0)             */
      __O  uint32_t  VS_OV_ICLR :  1;               /*!< [5..5] VS Overvoltage Interrupt Status (ADC2 channel 1)               */
      __O  uint32_t  VDD5V_OV_ICLR:  1;             /*!< [6..6] VDDP Overvoltage Interrupt Status (ADC2 channel 2)             */
      __O  uint32_t  VDD1V5_OV_ICLR:  1;            /*!< [7..7] VDDC Overvoltage Interrupt Status (ADC2 channel 3)             */
           uint32_t             :  8;
      __O  uint32_t  VBAT_UV_SCLR:  1;              /*!< [16..16] VBAT Undervoltage Status                                     */
      __O  uint32_t  VS_UV_SCLR :  1;               /*!< [17..17] VS Undervoltage Status                                       */
      __O  uint32_t  VDD5V_UV_SCLR:  1;             /*!< [18..18] VDDP Undervoltage Status                                     */
      __O  uint32_t  VDD1V5_UV_SCLR:  1;            /*!< [19..19] VDDC Undervoltage Status                                     */
      __O  uint32_t  VBAT_OV_SCLR:  1;              /*!< [20..20] VBAT Overvoltage Status                                      */
      __O  uint32_t  VS_OV_SCLR :  1;               /*!< [21..21] VS Overvoltage Interrupt Status                              */
      __O  uint32_t  VDD5V_OV_SCLR:  1;             /*!< [22..22] VDDP Overvoltage Status                                      */
      __O  uint32_t  VDD1V5_OV_SCLR:  1;            /*!< [23..23] VDDC Overvoltage Status                                      */
    } bit;                                          /*!< [24] BitSize                                                          */
  } SYS_SUPPLY_IRQ_CLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006028) System Interrupt Control                               */
    
    struct {
      __IO uint32_t  LIN_OC_IE  :  1;               /*!< [0..0] LIN Overcurrent Interrupt Enable                               */
      __IO uint32_t  LIN_OT_IE  :  1;               /*!< [1..1] LIN Overtemperature Interrupt Enable                           */
      __IO uint32_t  LIN_TMOUT_IE:  1;              /*!< [2..2] LIN TXD timeout Interrupt Enable                               */
           uint32_t             :  3;
      __IO uint32_t  PMU_OTWARN_IE:  1;             /*!< [6..6] PMU Regulator Overtemperature Warning Interrupt Enable         */
      __IO uint32_t  PMU_OT_IE  :  1;               /*!< [7..7] PMU Regulator Overtemperature Shutdown Interrupt Enable
                                                         (leads to shutdown of System)                                         */
      __IO uint32_t  SYS_OTWARN_IE:  1;             /*!< [8..8] System Overtemperature Warning Interrupt Enable                */
      __IO uint32_t  SYS_OT_IE  :  1;               /*!< [9..9] System Overtemperature Shutdown Interrupt Enable (leads
                                                         to shutdown of System)                                                */
      __IO uint32_t  REFBG_LOTHWARN_IE:  1;         /*!< [10..10] Reference Voltage Undervoltage Interrupt Enable              */
      __IO uint32_t  REFBG_UPTHWARN_IE:  1;         /*!< [11..11] Reference Voltage Overvoltage Interrupt Enable               */
      __IO uint32_t  VREF5V_LOWTH_IE:  1;           /*!< [12..12] VREF5V ADC1 Reference Undervoltage (ADC2, Channel 4)
                                                         Interrupt Enable                                                      */
      __IO uint32_t  VREF5V_UPTH_IE:  1;            /*!< [13..13] VREF5V ADC1 Reference Overvoltage (ADC2, Channel 4)
                                                         Interrupt Enable                                                      */
      __IO uint32_t  VREF5V_OVL_IE:  1;             /*!< [14..14] VREF5V Overload Interrupt Enable                             */
      __IO uint32_t  ADC2_ESM_IE:  1;               /*!< [15..15] ADC2 Exceptional Sequence Measurement Interrupt Enable       */
    } bit;                                          /*!< [16] BitSize                                                          */
  } SYS_IRQ_CTRL;
  __I  uint32_t  RESERVED2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006030) Power Control Unit Control Status                      */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  CLKWDT_SD_DIS:  1;             /*!< [1..1] Power Modules Clock Watchdog Shutdown Disable                  */
           uint32_t             :  5;
      __IO uint32_t  FAIL_PS_DIS:  1;               /*!< [7..7] Disable LIN, BDRV and CP because of Overtemperature            */
      __IO uint32_t  LIN_VS_UV_SD_DIS:  1;          /*!< [8..8] LIN Module VS Undervoltage Transmitter Shutdown                */
           uint32_t             : 5;
      __IO uint32_t  SYS_VSD_OV_SLM_DIS:  1;        /*!< [14..14] VSD Overvoltage Shutdown for Peripherals Disable             */
           uint32_t             : 9;
      __IO uint32_t  SYS_OT_PS_DIS:  1;             /*!< [24..24] System Overtemperature Power Switches Shutdown Disable       */
      __IO uint32_t  CLKLOSS_SD_DIS:  1;            /*!< [25..25] Power Switches Loss of Clock Shutdown Disable (AMCLK3)       */
      __IO uint32_t  CLKWDT_RES_SD_DIS:  1;         /*!< [26..26] Clock Watchdog Reset Disable                                 */
    } bit;                                          /*!< [26] BitSize                                                          */
  } PCU_CTRL_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50006034) WDT1 Watchdog Control                                  */
    
