alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint32_t  WDP_SEL    :  6;               /*!< [0..5] Watchdog Period Selection and trigger                          */
      __IO uint32_t  SOWCONF    :  2;               /*!< [6..7] Short Open Window Configuration                                */
    } bit;                                          /*!< [8] BitSize                                                           */
  } WDT1_TRIG;
  __I  uint32_t  RESERVED3[7];
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50006054) Bridge Driver Interrrupt Status Clear                  */
    
    struct {
      __O  uint32_t  LS1_DS_ICLR:  1;               /*!< [0..0] Bridge Driver Low Side 1 Pre-Driver short Interrupt Status     */
      __O  uint32_t  LS2_DS_ICLR:  1;               /*!< [1..1] Bridge Driver Low Side 2 Pre-Driver short Interrupt Status     */
      __O  uint32_t  HS1_DS_ICLR:  1;               /*!< [2..2] Bridge Driver High Side 1 Pre-Driver short Interrupt
                                                         Status                                                                */
      __O  uint32_t  HS2_DS_ICLR:  1;               /*!< [3..3] Bridge Driver High Side 2 Pre-Driver short Interrupt
                                                         Status                                                                */
           uint32_t             :  6;
      __O  uint32_t  LS1_OC_ICLR:  1;               /*!< [10..10] External Low Side 1 FET Over-current Status                  */
      __O  uint32_t  LS2_OC_ICLR:  1;               /*!< [11..11] External Low Side 2 FET Over-current Status                  */
      __O  uint32_t  HS1_OC_ICLR:  1;               /*!< [12..12] External High 1 FET Over-current Status                      */
      __O  uint32_t  HS2_OC_ICLR:  1;               /*!< [13..13] External High Side 2 FET Over-current Status                 */
           uint32_t             :  2;
      __O  uint32_t  VCP_LOWTH2_ICLR:  1;           /*!< [16..16] Warning for VCP Lower Threshold 2 Measurement (VCP_LOW
                                                         Signal from CP) Interrupt Status                                      */
      __O  uint32_t  VCP_LOWTH1_ICLR:  1;           /*!< [17..17] Warning for VCP Lower Threshold 1 Measurement (ADC2
                                                         channel 7) Interrupt Status                                           */
      __O  uint32_t  VCP_UPTH_ICLR:  1;             /*!< [18..18] Warning for VCP Upper Threshold Measurement (ADC2 channel
                                                         7) Interrupt Status                                                   */
      __O  uint32_t  VSD_LOWTH_ICLR:  1;            /*!< [19..19] Warning for VSD Lower Threshold Measurement (ADC2 channel
                                                         6) Interrupt Status                                                   */
      __O  uint32_t  VSD_UPTH_ICLR:  1;             /*!< [20..20] Warning for VSD Upper Threshold Measurement (ADC2 channel
                                                         6) Interrupt Status                                                   */
           uint32_t             :  3;
      __O  uint32_t  VCP_LOWTH2_SCLR:  1;           /*!< [24..24] Warning for VCP Lower Threshold 2 Measurement (VCP_LOW
                                                         Signal from CP) Status                                                */
      __O  uint32_t  VCP_LOWTH1_SCLR:  1;           /*!< [25..25] Warning for VCP Lower Threshold 1 Measurement (ADC2
                                                         channel 7) Status                                                     */
      __O  uint32_t  VCP_UPTH_SCLR:  1;             /*!< [26..26] Warning for VCP Upper Threshold Measurement (ADC2 channel
                                                         7) Status                                                             */
      __O  uint32_t  VSD_LOWTH_SCLR:  1;            /*!< [27..27] Warning for VSD Lower Threshold Measurement (ADC2 channel
                                                         6) Status                                                             */
      __O  uint32_t  VSD_UPTH_SCLR:  1;             /*!< [28..28] Warning for VSD Upper Threshold Measurement (ADC2 channel
                                                         6) Status                                                             */
    } bit;                                          /*!< [29] BitSize                                                          */
  } BDRV_ISCLR;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50006058) Bridge Driver Interrrupt Status                        */
    
    struct {
      __I  uint32_t  LS1_DS_IS  :  1;               /*!< [0..0] Bridge Driver Low Side 1 Pre-Driver short Interrupt Status     */
      __I  uint32_t  LS2_DS_IS  :  1;               /*!< [1..1] Bridge Driver Low Side 2 Pre-Driver short Interrupt Status     */
      __I  uint32_t  HS1_DS_IS  :  1;               /*!< [2..2] Bridge Driver High Side 1 Pre-Driver short Interrupt
                                                         Status                                                                */
      __I  uint32_t  HS2_DS_IS  :  1;               /*!< [3..3] Bridge Driver High Side 2 Pre-Driver short Interrupt
                                                         Status                                                                */
           uint32_t             :  6;
      __I  uint32_t  LS1_OC_IS  :  1;               /*!< [10..10] External Low Side 1 FET Over-current Status                  */
      __I  uint32_t  LS2_OC_IS  :  1;               /*!< [11..11] External Low Side 2 FET Over-current Status                  */
      __I  uint32_t  HS1_OC_IS  :  1;               /*!< [12..12] External High 1 FET Over-current Status                      */
      __I  uint32_t  HS2_OC_IS  :  1;               /*!< [13..13] External High Side 2 FET Over-current Status                 */
           uint32_t             :  2;
      __I  uint32_t  VCP_LOWTH2_IS:  1;             /*!< [16..16] Warning for VCP Lower Threshold 2 Measurement (VCP_LOW
                                                         Signal from CP) Interrupt Status                                      */
      __I  uint32_t  VCP_LOWTH1_IS:  1;             /*!< [17..17] Warning for VCP Lower Threshold 1 Measurement (ADC2
                                                         channel 7) Interrupt Status                                           */
      __I  uint32_t  VCP_UPTH_IS:  1;               /*!< [18..18] Warning for VCP Upper Threshold Measurement (ADC2 channel
                                                         7) Interrupt Status                                                   */
      __I  uint32_t  VSD_LOWTH_IS:  1;              /*!< [19..19] Warning for VSD Lower Threshold Measurement (ADC2 channel
                                                         6) Interrupt Status                                                   */
      __I  uint32_t  VSD_UPTH_IS:  1;               /*!< [20..20] Warning for VSD Upper Threshold Measurement (ADC2 channel
                                                         6) Interrupt Status                                                   */
           uint32_t             :  3;
      __I  uint32_t  VCP_LOWTH2_STS:  1;            /*!< [24..24] Warning for VCP Lower Threshold 2 Measurement (VCP_LOW
                                                         Signal from CP) Status                                                */
      __I  uint32_t  VCP_LOWTH1_STS:  1;            /*!< [25..25] Warning for VCP Lower Threshold 1 Measurement (ADC2
                                                         channel 7) Status                                                     */
      __I  uint32_t  VCP_UPTH_STS:  1;              /*!< [26..26] Warning for VCP Upper Threshold Measurement (ADC2 channel
                                                         7) Status                                                             */
      __I  uint32_t  VSD_LOWTH_STS:  1;             /*!< [27..27] Warning for VSD Lower Threshold Measurement (ADC2 channel
                                                         6) Status                                                             */
      __I  uint32_t  VSD_UPTH_STS:  1;              /*!< [28..28] Warning for VSD Upper Threshold Measurement (ADC2 channel
                                                         6) Status                                                             */
    } bit;                                          /*!< [29] BitSize                                                          */
  } BDRV_IS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000605C) Bridge Driver Interrupt Control                        */
    
