alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint32_t  LS1_DS_IE  :  1;               /*!< [0..0] Bridge Driver Low Side 1 Pre-Driver Short Interrupt Enable     */
      __IO uint32_t  LS2_DS_IE  :  1;               /*!< [1..1] Bridge Driver Low Side 2 Pre-Driver Short Interrupt Enable     */
      __IO uint32_t  HS1_DS_IE  :  1;               /*!< [2..2] Bridge Driver High Side 1 Pre-Driver Short Interrupt
                                                         Enable                                                                */
      __IO uint32_t  HS2_DS_IE  :  1;               /*!< [3..3] Bridge Driver High Side 2 Pre-Driver Short Interrupt
                                                         Enable                                                                */
           uint32_t             :  6;
      __IO uint32_t  LS1_OC_IE  :  1;               /*!< [10..10] External Low Side 1 FET Over-current Interrupt Enable        */
      __IO uint32_t  LS2_OC_IE  :  1;               /*!< [11..11] External Low Side 2 FET Over-current Interrupt Enable        */
      __IO uint32_t  HS1_OC_IE  :  1;               /*!< [12..12] External High Side 1 FET Over-current Interrupt Enable       */
      __IO uint32_t  HS2_OC_IE  :  1;               /*!< [13..13] External High Side 2 FET Over-current Interrupt Enable       */
           uint32_t             :  2;
      __IO uint32_t  VCP_LOWTH2_IE:  1;             /*!< [16..16] VCP Measurement Lower Threshold 2 Interrupt Enable           */
      __IO uint32_t  VCP_LOWTH1_IE:  1;             /*!< [17..17] VCP Measurement Lower Threshold 1 Interrupt Enable           */
      __IO uint32_t  VCP_UPTH_IE:  1;               /*!< [18..18] VCP Measurement Upper Threshold Interrupt Enable             */
      __IO uint32_t  VSD_LOWTH_IE:  1;              /*!< [19..19] VSD Measurement Lower Threshold Interrupt Enable             */
      __IO uint32_t  VSD_UPTH_IE:  1;               /*!< [20..20] VSD Measurement Upper Threshold Interrupt Enable             */
    } bit;                                          /*!< [21] BitSize                                                          */
  } BDRV_IRQ_CTRL;
  __I  uint32_t  RESERVED4[3];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5000606C) System Tick Calibration Register                       */
    
    struct {
      __IO uint32_t  STCALIB    : 26;               /*!< [0..25] System Tick Calibration                                       */
    } bit;                                          /*!< [26] BitSize                                                          */
  } STCALIB;
  __I  uint32_t  RESERVED5[4];
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50006080) Bus Fault Status                                       */
    
    struct {
      __I  uint32_t  DBFSTS     :  1;               /*!< [0..0] Data Bus Fault Status Valid Flag                               */
      __I  uint32_t  SBFSTS     :  1;               /*!< [1..1] System Bus Fault Status Valid Flag                             */
    } bit;                                          /*!< [2] BitSize                                                           */
  } BFSTS;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50006084) Data Bus Fault Address Register                        */
    
    struct {
      __I  uint32_t  DBFA       : 32;               /*!< [0..31] Reserved                                                      */
    } bit;                                          /*!< [32] BitSize                                                          */
  } DBFA;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50006088) System Bus Fault Address Register                      */
    
    struct {
      __I  uint32_t  SBFA       : 32;               /*!< [0..31] Reserved                                                      */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SBFA;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x5000608C) Bus Fault Status Clear Register                        */
    
    struct {
      __O  uint32_t  DBFSTSCLR  :  1;               /*!< [0..0] Data Bus Fault Status Clear Flag                               */
      __O  uint32_t  SBFSTSCLR  :  1;               /*!< [1..1] System Bus Fault Status Clear Flag                             */
    } bit;                                          /*!< [2] BitSize                                                           */
  } BFSTS_CLR;
} SCUPM_Type;


/* ================================================================================ */
/* ================                       CPU                      ================ */
/* ================================================================================ */


/**
  * @brief CPU (CPU)
  */

typedef struct {                                    /*!< (@ 0xE000E000) CPU Structure                                          */
  __I  uint32_t  RESERVED0;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0xE000E004) Interrupt Controller Type                              */
    
    struct {
      __I  uint32_t  INTLINESNUM:  5;               /*!< [0..4] Interrupt Lines                                                */
    } bit;                                          /*!< [5] BitSize                                                           */
  } ICT;
  __I  uint32_t  RESERVED1[2];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E010) SysTick Control and Status                             */
    
    struct {
      __IO uint32_t  ENABLE     :  1;               /*!< [0..0] Enable                                                         */
      __IO uint32_t  TICKINT    :  1;               /*!< [1..1] TICKINT                                                        */
      __IO uint32_t  CLKSOURCE  :  1;               /*!< [2..2] CLK Source                                                     */
           uint32_t             : 13;
      __IO uint32_t  COUNTFLAG  :  1;               /*!< [16..16] Count Flag                                                   */
    } bit;                                          /*!< [17] BitSize                                                          */
  } SYSTICK_CS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E014) SysTick Reload Value                                   */
    
