alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint32_t  RELOAD     : 24;               /*!< [0..23] Reload                                                        */
    } bit;                                          /*!< [24] BitSize                                                          */
  } SYSTICK_RL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E018) SysTick Current Value                                  */
    
    struct {
      __IO uint32_t  CURRENT    : 24;               /*!< [0..23] Current                                                       */
    } bit;                                          /*!< [24] BitSize                                                          */
  } SYSTICK_CUR;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0xE000E01C) SysTick Calibration Value                              */
    
    struct {
      __I  uint32_t  TENMS      : 24;               /*!< [0..23] Tenms                                                         */
           uint32_t             :  6;
      __I  uint32_t  SKEW       :  1;               /*!< [30..30] Skew                                                         */
      __I  uint32_t  NOREF      :  1;               /*!< [31..31] No Reference Clock                                           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SYSTICK_CAL;
  __I  uint32_t  RESERVED2[56];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E100) Interrupt Set-Enable                                   */
    
    struct {
      __IO uint32_t  Int_GPT1   :  1;               /*!< [0..0] Interrupt Set for GPT1                                         */
      __IO uint32_t  Int_GPT2   :  1;               /*!< [1..1] Interrupt Set for GPT2                                         */
      __IO uint32_t  Int_ADC2   :  1;               /*!< [2..2] Interrupt Set for MU, ADC2                                     */
      __IO uint32_t  Int_ADC1   :  1;               /*!< [3..3] Interrupt Set for ADC1                                         */
      __IO uint32_t  Int_CCU6SR0:  1;               /*!< [4..4] Interrupt Set for CCU6 SR0                                     */
      __IO uint32_t  Int_CCU6SR1:  1;               /*!< [5..5] Interrupt Set for CCU6 SR1                                     */
      __IO uint32_t  Int_CCU6SR2:  1;               /*!< [6..6] Interrupt Set for CCU6 SR2                                     */
      __IO uint32_t  Int_CCU6SR3:  1;               /*!< [7..7] Interrupt Set for CCU6 SR3                                     */
      __IO uint32_t  Int_SSC1   :  1;               /*!< [8..8] Interrupt Set for SSC1                                         */
      __IO uint32_t  Int_SSC2   :  1;               /*!< [9..9] Interrupt Set for SSC2                                         */
      __IO uint32_t  Int_UART1  :  1;               /*!< [10..10] Interrupt Set for UART1                                      */
      __IO uint32_t  Int_UART2  :  1;               /*!< [11..11] Interrupt Set for UART2                                      */
      __IO uint32_t  Int_EXINT0 :  1;               /*!< [12..12] Interrupt Set for External Int 0                             */
      __IO uint32_t  Int_EXINT1 :  1;               /*!< [13..13] Interrupt Set for External Int 1                             */
      __IO uint32_t  Int_BDRV   :  1;               /*!< [14..14] Interrupt Set for Bridge Driver                              */
      __IO uint32_t  Int_DMA    :  1;               /*!< [15..15] Interrupt Set for DMA                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } NVIC_ISER0;
  __I  uint32_t  RESERVED3[31];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E180) Interrupt Clear-Enable                                 */
    
    struct {
      __IO uint32_t  Int_GPT1   :  1;               /*!< [0..0] Interrupt Clear for GPT1                                       */
      __IO uint32_t  Int_GPT2   :  1;               /*!< [1..1] Interrupt Clear for GPT2                                       */
      __IO uint32_t  Int_ADC2   :  1;               /*!< [2..2] Interrupt Clear for MU, ADC2                                   */
      __IO uint32_t  Int_ADC1   :  1;               /*!< [3..3] Interrupt Clear for ADC1                                       */
      __IO uint32_t  Int_CCU6SR0:  1;               /*!< [4..4] Interrupt Clear for CCU6 SR0                                   */
      __IO uint32_t  Int_CCU6SR1:  1;               /*!< [5..5] Interrupt Clear for CCU6 SR1                                   */
      __IO uint32_t  Int_CCU6SR2:  1;               /*!< [6..6] Interrupt Clear for CCU6 SR2                                   */
      __IO uint32_t  Int_CCU6SR3:  1;               /*!< [7..7] Interrupt Clear for CCU6 SR3                                   */
      __IO uint32_t  Int_SSC1   :  1;               /*!< [8..8] Interrupt Clear for SSC1                                       */
      __IO uint32_t  Int_SSC2   :  1;               /*!< [9..9] Interrupt Clear for SSC2                                       */
      __IO uint32_t  Int_UART1  :  1;               /*!< [10..10] Interrupt Clear for UART1                                    */
      __IO uint32_t  Int_UART2  :  1;               /*!< [11..11] Interrupt Clear for UART2                                    */
      __IO uint32_t  Int_EXINT0 :  1;               /*!< [12..12] Interrupt Clear for External Int 0                           */
      __IO uint32_t  Int_EXINT1 :  1;               /*!< [13..13] Interrupt Clear for External Int 1                           */
      __IO uint32_t  Int_BDRV   :  1;               /*!< [14..14] Interrupt Clear for Bridge Driver                            */
      __IO uint32_t  Int_DMA    :  1;               /*!< [15..15] Interrupt Clr for DMA                                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } NVIC_ICER0;
  __I  uint32_t  RESERVED4[31];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E200) Interrupt Set-Pending                                  */
    
