alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint32_t  Int_GPT1   :  1;               /*!< [0..0] Interrupt Set Pending for GPT1                                 */
      __IO uint32_t  Int_GPT2   :  1;               /*!< [1..1] Interrupt Set Pending for GPT2                                 */
      __IO uint32_t  Int_ADC2   :  1;               /*!< [2..2] Interrupt Set Pending for MU, ADC2                             */
      __IO uint32_t  Int_ADC1   :  1;               /*!< [3..3] Interrupt Set Pending for ADC1                                 */
      __IO uint32_t  Int_CCU6SR0:  1;               /*!< [4..4] Interrupt Set Pending for CCU6 SR0                             */
      __IO uint32_t  Int_CCU6SR1:  1;               /*!< [5..5] Interrupt Set Pending for CCU6 SR1                             */
      __IO uint32_t  Int_CCU6SR2:  1;               /*!< [6..6] Interrupt Set Pending for CCU6 SR2                             */
      __IO uint32_t  Int_CCU6SR3:  1;               /*!< [7..7] Interrupt Set Pending for CCU6 SR3                             */
      __IO uint32_t  Int_SSC1   :  1;               /*!< [8..8] Interrupt Set Pending for SSC1                                 */
      __IO uint32_t  Int_SSC2   :  1;               /*!< [9..9] Interrupt Set Pending for SSC2                                 */
      __IO uint32_t  Int_UART1  :  1;               /*!< [10..10] Interrupt Set Pending for UART1                              */
      __IO uint32_t  Int_UART2  :  1;               /*!< [11..11] Interrupt Set Pending for UART2                              */
      __IO uint32_t  Int_EXINT0 :  1;               /*!< [12..12] Interrupt Set Pending for External Int 0                     */
      __IO uint32_t  Int_EXINT1 :  1;               /*!< [13..13] Interrupt Set Pending for External Int 1                     */
      __IO uint32_t  Int_BDRV   :  1;               /*!< [14..14] Interrupt Set Pending for Bridge Driver                      */
      __IO uint32_t  Int_DMA    :  1;               /*!< [15..15] Interrupt Set Pend for DMA                                   */
    } bit;                                          /*!< [16] BitSize                                                          */
  } NVIC_ISPR0;
  __I  uint32_t  RESERVED5[6];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E21C) System Handler Priority Register 2                     */
    
    struct {
      __IO uint32_t  PRI_8      :  8;               /*!< [0..7] Reserved for Priority of System Handler 8                      */
      __IO uint32_t  PRI_9      :  8;               /*!< [8..15] Reserved for Priority of System Handler 9                     */
      __IO uint32_t  PRI_10     :  8;               /*!< [16..23] Reserved for Priority of System Handler 10                   */
      __IO uint32_t  PRI_11     :  8;               /*!< [24..31] Priority of System Handler 11, SVCall                        */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SHPR2;
  __I  uint32_t  RESERVED6[24];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E280) Interrupt Clear-Pending                                */
    
    struct {
      __IO uint32_t  Int_GPT1   :  1;               /*!< [0..0] Interrupt Clear Pending for GPT1                               */
      __IO uint32_t  Int_GPT2   :  1;               /*!< [1..1] Interrupt Clear Pending for GPT2                               */
      __IO uint32_t  Int_ADC2   :  1;               /*!< [2..2] Interrupt Clear Pending for MU, ADC2                           */
      __IO uint32_t  Int_ADC1   :  1;               /*!< [3..3] Interrupt Clear Pending for ADC1                               */
      __IO uint32_t  Int_CCU6SR0:  1;               /*!< [4..4] Interrupt Clear Pending for CCU6 SR0                           */
      __IO uint32_t  Int_CCU6SR1:  1;               /*!< [5..5] Interrupt Clear Pending for CCU6 SR1                           */
      __IO uint32_t  Int_CCU6SR2:  1;               /*!< [6..6] Interrupt Clear Pending for CCU6 SR2                           */
      __IO uint32_t  Int_CCU6SR3:  1;               /*!< [7..7] Interrupt Clear Pending for CCU6 SR3                           */
      __IO uint32_t  Int_SSC1   :  1;               /*!< [8..8] Interrupt Clear Pending for SSC1                               */
      __IO uint32_t  Int_SSC2   :  1;               /*!< [9..9] Interrupt Clear Pending for SSC2                               */
      __IO uint32_t  Int_UART1  :  1;               /*!< [10..10] Interrupt Clear Pending for UART1                            */
      __IO uint32_t  Int_UART2  :  1;               /*!< [11..11] Interrupt Clear Pending for UART2                            */
      __IO uint32_t  Int_EXINT0 :  1;               /*!< [12..12] Interrupt Clear Pending for External Int 0                   */
      __IO uint32_t  Int_EXINT1 :  1;               /*!< [13..13] Interrupt Clear Pending for External Int 1                   */
      __IO uint32_t  Int_BDRV   :  1;               /*!< [14..14] Interrupt Clear Pending for Bridge Driver                    */
      __IO uint32_t  Int_DMA    :  1;               /*!< [15..15] Interrupt Clr Pend for DMA                                   */
    } bit;                                          /*!< [16] BitSize                                                          */
  } NVIC_ICPR0;
  __I  uint32_t  RESERVED7[31];
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0xE000E300) Active Bit Register Interrupt Active Flags             */
    
    struct {
      __I  uint32_t  Int_GPT1   :  1;               /*!< [0..0] Interrupt Active for GPT1                                      */
      __I  uint32_t  Int_GPT2   :  1;               /*!< [1..1] Interrupt Active for GPT2                                      */
      __I  uint32_t  Int_ADC2   :  1;               /*!< [2..2] Interrupt Active for MU, ADC2                                  */
      __I  uint32_t  Int_ADC1   :  1;               /*!< [3..3] Interrupt Active for ADC1                                      */
      __I  uint32_t  Int_CCU6SR0:  1;               /*!< [4..4] Interrupt Active for CCU6 SR0                                  */
      __I  uint32_t  Int_CCU6SR1:  1;               /*!< [5..5] Interrupt Active for CCU6 SR1                                  */
      __I  uint32_t  Int_CCU6SR2:  1;               /*!< [6..6] Interrupt Active for CCU6 SR2                                  */
      __I  uint32_t  Int_CCU6SR3:  1;               /*!< [7..7] Interrupt Active for CCU6 SR3                                  */
      __I  uint32_t  Int_SSC1   :  1;               /*!< [8..8] Interrupt Active for SSC1                                      */
      __I  uint32_t  Int_SSC2   :  1;               /*!< [9..9] Interrupt Active for SSC2                                      */
      __I  uint32_t  Int_UART1  :  1;               /*!< [10..10] Interrupt Active for UART1                                   */
      __I  uint32_t  Int_UART2  :  1;               /*!< [11..11] Interrupt Active for UART2                                   */
      __I  uint32_t  Int_EXINT0 :  1;               /*!< [12..12] Interrupt Active for External Int 0                          */
      __I  uint32_t  Int_EXINT1 :  1;               /*!< [13..13] Interrupt Active for External Int 1                          */
      __I  uint32_t  Int_BDRV   :  1;               /*!< [14..14] Interrupt Active for Bridge Driver                           */
      __I  uint32_t  Int_DMA    :  1;               /*!< [15..15] Interrupt Active for DMA                                     */
    } bit;                                          /*!< [16] BitSize                                                          */
  } NVIC_IABR0;
  __I  uint32_t  RESERVED8[63];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E400) Interrupt Priority                                     */
    
