alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint32_t  PRI_GPT1   :  8;               /*!< [0..7] Priority for GPT1                                              */
      __IO uint32_t  PRI_GPT2   :  8;               /*!< [8..15] Priority for GPT2                                             */
      __IO uint32_t  PRI_ADC2   :  8;               /*!< [16..23] Priority for MU, ADC2                                        */
      __IO uint32_t  PRI_ADC1   :  8;               /*!< [24..31] Priority for ADC1                                            */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E404) Interrupt Priority                                     */
    
    struct {
      __IO uint32_t  PRI_CCU6SR0:  8;               /*!< [0..7] Priority for CCU6 SR0                                          */
      __IO uint32_t  PRI_CCU6SR1:  8;               /*!< [8..15] Priority for CCU6 SR1                                         */
      __IO uint32_t  PRI_CCU6SR2:  8;               /*!< [16..23] Priority for CCU6 SR2                                        */
      __IO uint32_t  PRI_CCU6SR3:  8;               /*!< [24..31] Priority for CCU6 SR3                                        */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E408) Interrupt Priority                                     */
    
    struct {
      __IO uint32_t  PRI_SSC1   :  8;               /*!< [0..7] Priority for SSC1                                              */
      __IO uint32_t  PRI_SSC2   :  8;               /*!< [8..15] Priority for SSC2                                             */
      __IO uint32_t  PRI_UART1  :  8;               /*!< [16..23] Priority for UART1                                           */
      __IO uint32_t  PRI_UART2  :  8;               /*!< [24..31] Priority for UART2                                           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000E40C) Interrupt Priority                                     */
    
    struct {
      __IO uint32_t  PRI_EXINT0 :  8;               /*!< [0..7] Priority for Ext. Int 0                                        */
      __IO uint32_t  PRI_EXINT1 :  8;               /*!< [8..15] Priority for Ext. Int 1                                       */
      __IO uint32_t  PRI_BDRV   :  8;               /*!< [16..23] Priority for Bridge Driver                                   */
      __IO uint32_t  PRI_DMA    :  8;               /*!< [24..31] Priority for DMA                                             */
    } bit;                                          /*!< [32] BitSize                                                          */
  } NVIC_IPR3;
  __I  uint32_t  RESERVED9[572];
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0xE000ED00) CPU ID Base Register                                   */
    
    struct {
      __I  uint32_t  REVISION   :  4;               /*!< [0..3] Revision Number                                                */
      __I  uint32_t  PARTNO     : 12;               /*!< [4..15] Part Number                                                   */
      __I  uint32_t  ARCHITECTURE:  4;              /*!< [16..19] Architecture                                                 */
      __I  uint32_t  VARIANT    :  4;               /*!< [20..23] Variant Number                                               */
      __I  uint32_t  IMPLEMENTER:  8;               /*!< [24..31] Implementer Code                                             */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CPUID;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED04) Interrupt Control State Register                       */
    
    struct {
      __I  uint32_t  VECTACTIVE :  9;               /*!< [0..8] VECTACTIVE                                                     */
           uint32_t             :  2;
      __I  uint32_t  RETTOBASE  :  1;               /*!< [11..11] RETTOBASE                                                    */
      __I  uint32_t  VECTPENDING:  9;               /*!< [12..20] VECTPENDING                                                  */
           uint32_t             :  1;
      __I  uint32_t  ISRPENDING :  1;               /*!< [22..22] ISRPENDING                                                   */
      __I  uint32_t  ISRPREEMPT :  1;               /*!< [23..23] ISRPREEMPT                                                   */
           uint32_t             :  1;
      __O  uint32_t  PENDSTCLR  :  1;               /*!< [25..25] PENDSTCLR                                                    */
      __IO uint32_t  PENDSTSET  :  1;               /*!< [26..26] PENDSTSET                                                    */
      __O  uint32_t  PENDSVCLR  :  1;               /*!< [27..27] PENDSVCLR                                                    */
      __IO uint32_t  PENDSVSET  :  1;               /*!< [28..28] PENDSVSET                                                    */
           uint32_t             :  2;
      __IO uint32_t  NMIPENDSET :  1;               /*!< [31..31] NMI PendSet                                                  */
    } bit;                                          /*!< [32] BitSize                                                          */
  } ICSR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED08) Vector Table Offset Register                           */
    
