alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
           uint32_t             :  7;
      __IO uint32_t  TBLOFF     : 25;               /*!< [7..31] Vector Table Offset                                           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } VTOR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED0C) Application Interrupt/Reset Control Register           */
    
    struct {
      __O  uint32_t  VECTRESET  :  1;               /*!< [0..0] VECTRESET                                                      */
      __O  uint32_t  VECTCLRACTIVE:  1;             /*!< [1..1] VECTCLRACTIVE                                                  */
      __IO uint32_t  SYSRESETREQ:  1;               /*!< [2..2] System Reset Request                                           */
           uint32_t             :  5;
      __IO uint32_t  PRIGROUP   :  3;               /*!< [8..10] Priority Grouping                                             */
           uint32_t             :  4;
      __I  uint32_t  ENDIANNESS :  1;               /*!< [15..15] Memory System Endianness                                     */
      __IO uint32_t  VECTKEY    : 16;               /*!< [16..31] Vector Key                                                   */
    } bit;                                          /*!< [32] BitSize                                                          */
  } AIRCR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED10) System Control Register                                */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  SLEEPONEXIT:  1;               /*!< [1..1] Sleep on Exit                                                  */
      __IO uint32_t  SLEEPDEEP  :  1;               /*!< [2..2] Sleep Deep                                                     */
           uint32_t             :  1;
      __IO uint32_t  SEVONPEND  :  1;               /*!< [4..4] SEVONPEND                                                      */
    } bit;                                          /*!< [5] BitSize                                                           */
  } SCR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED14) Configuration Control Register                         */
    
    struct {
      __IO uint32_t  NONBASETHRDENA:  1;            /*!< [0..0] NONBASETHRDENA                                                 */
      __IO uint32_t  USERSETMPEND:  1;              /*!< [1..1] USERSETMPEND                                                   */
           uint32_t             :  1;
      __IO uint32_t  UNALIGN_TRP:  1;               /*!< [3..3] UNALIGN_TRP                                                    */
      __IO uint32_t  DIV_0_TRP  :  1;               /*!< [4..4] DIV_0_TRP                                                      */
           uint32_t             :  3;
      __IO uint32_t  BFHFMIGN   :  1;               /*!< [8..8] BFHFMIGN                                                       */
      __IO uint32_t  STKALIGN   :  1;               /*!< [9..9] STKALIGN                                                       */
    } bit;                                          /*!< [10] BitSize                                                          */
  } CCR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED18) System Handler Priority Register 1                     */
    
    struct {
      __IO uint32_t  PRI_4      :  8;               /*!< [0..7] Priority of System Handler 4, MemManage                        */
      __IO uint32_t  PRI_5      :  8;               /*!< [8..15] Priority of System Handler 5, BusFault                        */
      __IO uint32_t  PRI_6      :  8;               /*!< [16..23] Priority of System Handler 6, UsageFault                     */
      __IO uint32_t  PRI_7      :  8;               /*!< [24..31] Reserved for Priority of System Handler 7                    */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SHPR1;
  __I  uint32_t  RESERVED10;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED20) System Handler Priority Register 3                     */
    
    struct {
      __IO uint32_t  PRI_12     :  8;               /*!< [0..7] Priority of System Handler 12, DebugMonitor                    */
      __IO uint32_t  PRI_13     :  8;               /*!< [8..15] Reserved for Priority of System Handler 13                    */
      __IO uint32_t  PRI_14     :  8;               /*!< [16..23] Priority of System Handler 14, PendSV                        */
      __IO uint32_t  PRI_15     :  8;               /*!< [24..31] Priority of System Handler 15, SysTick                       */
    } bit;                                          /*!< [32] BitSize                                                          */
  } SHPR3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED24) System Handler Control and State Register              */
    
    struct {
      __IO uint32_t  MEMFAULTACT:  1;               /*!< [0..0] MEMFAULTACT                                                    */
      __IO uint32_t  BUSFAULTACT:  1;               /*!< [1..1] BUSFAULTACT                                                    */
           uint32_t             :  1;
      __IO uint32_t  USGFAULTACT:  1;               /*!< [3..3] USGFAULTACT                                                    */
           uint32_t             :  3;
      __IO uint32_t  SVCALLACT  :  1;               /*!< [7..7] SVCALLACT                                                      */
      __IO uint32_t  MONITORACT :  1;               /*!< [8..8] MONITORACT                                                     */
           uint32_t             :  1;
      __IO uint32_t  PENDSVACT  :  1;               /*!< [10..10] PENDSVACT                                                    */
      __IO uint32_t  SYSTICKACT :  1;               /*!< [11..11] SYSTICKACT                                                   */
      __IO uint32_t  USGFAULTPENDED:  1;            /*!< [12..12] USGFAULTPENDED                                               */
      __IO uint32_t  MEMFAULTPENDED:  1;            /*!< [13..13] MEMFAULTPENDED                                               */
      __IO uint32_t  BUSFAULTPENDED:  1;            /*!< [14..14] BUSFAULTPENDED                                               */
      __IO uint32_t  SVCALLPENDED:  1;              /*!< [15..15] SVCALLPENDED                                                 */
      __IO uint32_t  MEMFAULTENA:  1;               /*!< [16..16] MEMFAULTENA                                                  */
      __IO uint32_t  BUSFAULTENA:  1;               /*!< [17..17] BUSFAULTENA                                                  */
      __IO uint32_t  USGFAULTENA:  1;               /*!< [18..18] USGFAULTENA                                                  */
    } bit;                                          /*!< [19] BitSize                                                          */
  } SHCSR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED28) Configurable Fault Status Register                     */
    
