alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint32_t  IACCVIOL   :  1;               /*!< [0..0] IACCVIOL                                                       */
      __IO uint32_t  DACCVIOL   :  1;               /*!< [1..1] DACCVIOL                                                       */
           uint32_t             :  1;
      __IO uint32_t  MUNSTKERR  :  1;               /*!< [3..3] MUNSTKERR                                                      */
      __IO uint32_t  MSTERR     :  1;               /*!< [4..4] MSTERR                                                         */
      __IO uint32_t  MLSPERR    :  1;               /*!< [5..5] MLSPERR                                                        */
           uint32_t             :  1;
      __IO uint32_t  MMARVALID  :  1;               /*!< [7..7] MMARVALID                                                      */
      __IO uint32_t  IBUSERR    :  1;               /*!< [8..8] IBUSERR                                                        */
      __IO uint32_t  PRECISERR  :  1;               /*!< [9..9] PRECISERR                                                      */
      __IO uint32_t  IMPRECISERR:  1;               /*!< [10..10] IMPRECISERR                                                  */
      __IO uint32_t  UNSTKERR   :  1;               /*!< [11..11] UNSTKERR                                                     */
      __IO uint32_t  STKERR     :  1;               /*!< [12..12] STKERR                                                       */
      __IO uint32_t  LSPERR     :  1;               /*!< [13..13] LSPERR                                                       */
           uint32_t             :  1;
      __IO uint32_t  BFARVALID  :  1;               /*!< [15..15] BFAR Valid                                                   */
      __IO uint32_t  UNDEFINSTR :  1;               /*!< [16..16] Undefined Instruction                                        */
      __IO uint32_t  INVSTATE   :  1;               /*!< [17..17] INVSTATE                                                     */
      __IO uint32_t  INVPC      :  1;               /*!< [18..18] INVPC                                                        */
      __IO uint32_t  NOCP       :  1;               /*!< [19..19] No CP                                                        */
           uint32_t             :  4;
      __IO uint32_t  UNALIGNED  :  1;               /*!< [24..24] Unaligned                                                    */
      __IO uint32_t  DIVBYZERO  :  1;               /*!< [25..25] Divide by Zero                                               */
    } bit;                                          /*!< [26] BitSize                                                          */
  } CFSR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED2C) Hard Fault Status Register                             */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  VECTTBL    :  1;               /*!< [1..1] VECTTBL                                                        */
           uint32_t             : 28;
      __IO uint32_t  FORCED     :  1;               /*!< [30..30] Forced                                                       */
      __IO uint32_t  DEBUGEVT   :  1;               /*!< [31..31] Debug Event                                                  */
    } bit;                                          /*!< [32] BitSize                                                          */
  } HFSR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED30) Debug Fault Status Register                            */
    
    struct {
      __IO uint32_t  HALTED     :  1;               /*!< [0..0] HALTED                                                         */
      __IO uint32_t  BKPT       :  1;               /*!< [1..1] BKPT                                                           */
      __IO uint32_t  DWTTRAP    :  1;               /*!< [2..2] DWTTRAP                                                        */
      __IO uint32_t  VCATCH     :  1;               /*!< [3..3] Vector Catch                                                   */
      __IO uint32_t  EXTERNAL   :  1;               /*!< [4..4] External                                                       */
    } bit;                                          /*!< [5] BitSize                                                           */
  } DFSR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED34) MemManage Fault Status Register                        */
    
    struct {
      __IO uint32_t  ADDRESS    : 32;               /*!< [0..31] Data Address for an MPU Fault                                 */
    } bit;                                          /*!< [32] BitSize                                                          */
  } MMFAR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED38) Bus Fault Status Register                              */
    
    struct {
      __IO uint32_t  ADDRESS    : 32;               /*!< [0..31] Data Address for a precise BusFault                           */
    } bit;                                          /*!< [32] BitSize                                                          */
  } BFAR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0xE000ED3C) Auxiliary Fault Status Register                        */
    
    struct {
      __IO uint32_t  CP0        :  2;               /*!< [0..1] Access Privileges for Coprocessor 0 (n= 0-7, 10, 11)           */
      __IO uint32_t  CP1        :  2;               /*!< [2..3] Access Privileges for Coprocessor 1 (n= 0-7, 10, 11)           */
      __IO uint32_t  CP2        :  2;               /*!< [4..5] Access Privileges for Coprocessor 2 (n= 0-7, 10, 11)           */
      __IO uint32_t  CP3        :  2;               /*!< [6..7] Access Privileges for Coprocessor 3 (n= 0-7, 10, 11)           */
      __IO uint32_t  CP4        :  2;               /*!< [8..9] Access Privileges for Coprocessor 4 (n= 0-7, 10, 11)           */
      __IO uint32_t  CP5        :  2;               /*!< [10..11] Access Privileges for Coprocessor 5 (n= 0-7, 10, 11)         */
      __IO uint32_t  CP6        :  2;               /*!< [12..13] Access Privileges for Coprocessor 6 (n= 0-7, 10, 11)         */
      __IO uint32_t  CP7        :  2;               /*!< [14..15] Access Privileges for Coprocessor 7 (n= 0-7, 10, 11)         */
           uint32_t             :  4;
      __IO uint32_t  CP10       :  2;               /*!< [20..21] Access Privileges for Coprocessor 10 (n= 0-7, 10, 11)        */
      __IO uint32_t  CP11       :  2;               /*!< [22..23] Access Privileges for Coprocessor 11 (n= 0-7, 10, 11)        */
    } bit;                                          /*!< [24] BitSize                                                          */
  } AFSR;
} CPU_Type;


/* ================================================================================ */
/* ================                       DMA                      ================ */
/* ================================================================================ */


/**
  * @brief DMA (DMA)
  */

typedef struct {                                    /*!< (@ 0x50014000) DMA Structure                                          */
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50014000) DMA Status                                             */
    
