alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __I  uint32_t  MASTER_ENABLE:  1;             /*!< [0..0] Enable Status of the Controller                                */
           uint32_t             :  3;
      __I  uint32_t  STATE      :  4;               /*!< [4..7] Current State of the Control State Machine                     */
           uint32_t             :  8;
      __I  uint32_t  CHNLS_MINUS1:  5;              /*!< [16..20] Available Channels minus 1                                   */
    } bit;                                          /*!< [21] BitSize                                                          */
  } STATUS;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50014004) DMA Configuration                                      */
    
    struct {
      __O  uint32_t  MASTER_ENABLE:  1;             /*!< [0..0] Enable for the Controller                                      */
           uint32_t             :  4;
      __O  uint32_t  CHN1_PROT_CTRL:  3;            /*!< [5..7] CHN1_PROT_CTRL                                                 */
    } bit;                                          /*!< [8] BitSize                                                           */
  } CFG;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50014008) Channel Control Data Base Pointer                      */
    
    struct {
           uint32_t             :  9;
      __IO uint32_t  CTRL_BASE_PTR: 23;             /*!< [9..31] CTRL_BASE_PTR                                                 */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CTRL_BASE_PTR;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x5001400C) Channel Alternate Control Data Base Pointer            */
    
    struct {
      __I  uint32_t  ALT_CTRL_BASE_PTR: 32;         /*!< [0..31] Base Address of the Alternate Data Structure                  */
    } bit;                                          /*!< [32] BitSize                                                          */
  } ALT_CTRL_BASE_PTR;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x50014010) Channel Wait on Request Status                         */
    
    struct {
      __I  uint32_t  WAITONREQ_STATUS: 14;          /*!< [0..13] Channel Wait on Request Status                                */
    } bit;                                          /*!< [14] BitSize                                                          */
  } WAITONREQ_STATUS;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50014014) Channel Software Request                               */
    
    struct {
      __O  uint32_t  CHNL_SW_REQUEST: 14;           /*!< [0..13] CHNL_SW_REQUEST                                               */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_SW_REQUEST;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50014018) Channel Useburst Set                                   */
    
    struct {
      __IO uint32_t  CHNL_USEBURST_SET: 14;         /*!< [0..13] CHNL_USEBURST_SET: 0b0=on read: DMA channel n responds
                                                         to requests that it receives on dma_req[C] or dma_sreq[C]. The
                                                          controller performs 2, or single, bus transfers., 0b1=on read:
                                                          DMA channel n does not respond to requests that it receives
                                                          on dma_req[C] or dma_sreq[C]. The controller only reponds to
                                                          dma_req[C] requests and performs 2 transfers., 0b0=on write:
                                                          No effect. Use the CHNL_USEBURST_CLR Register to set bit [C]
                                                          to 0., 0b1=on write: Disables dma_sreq[C] from generating DMA
                                                          requests. The controller                                             */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_USEBURST_SET;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x5001401C) Channel Useburst Clear                                 */
    
    struct {
      __O  uint32_t  CHNL_USEBURST_CLR: 14;         /*!< [0..13] CHNL_USEBURST_CLR                                             */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_USEBURST_CLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50014020) Channel Request Mask Set                               */
    
    struct {
      __IO uint32_t  CHNL_REQ_MASK_SET: 14;         /*!< [0..13] CHNL_REQ_MASK_SET: 0b0=on read: External requests are
                                                         enabled for channel C., 0b1=on read: External requests are disabled
                                                          for channel C., 0b0=on write: No effect. Use the CHNL_REQ_MASK_CLR
                                                          Register to enable DMA requests., 0b1=on write: Disables dma_req[C]
                                                          and dma_sreq[C] from generating DMA requests.,                       */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_REQ_MASK_SET;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50014024) Channel Request Mask Clear                             */
    
    struct {
      __O  uint32_t  CHNL_REQ_MASK_CLR: 14;         /*!< [0..13] CHNL_REQ_MASK_CLR                                             */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_REQ_MASK_CLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50014028) Channel Enable Set                                     */
    
