alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint32_t  CHNL_ENABLE_SET: 14;           /*!< [0..13] CHNL_ENABLE_SET: 0b0=on read: Channel C is disabled.,
                                                         0b1=on read: Channel C is enabled., 0b0=on write: No effect.
                                                          Use the CHNL_ENABLE_CLR Register to disable a channel., 0b1=on
                                                          write: Enables channel C.,                                           */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_ENABLE_SET;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x5001402C) Channel Enable Clear                                   */
    
    struct {
      __O  uint32_t  CHNL_ENABLE_CLR: 14;           /*!< [0..13] CHNL_ENABLE_CLR                                               */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_ENABLE_CLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50014030) Channel Primary-Alternate Set                          */
    
    struct {
      __IO uint32_t  CHNL_PRI_ALT_SET: 14;          /*!< [0..13] CHNL_PRI_ALT_SET: 0b0=on read: DMA channel C is using
                                                         the primary data structure., 0b1=on read: DMA channel C is using
                                                          the alternate data structure., 0b0=on write: No effect. Use
                                                          the CHNL_PRI_ALT_CLR Register to set bit [C] to 0., 0b1=on write:
                                                          Selects the alternate data structure for channel C.,                 */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_PRI_ALT_SET;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x50014034) Channel Primary-Alternate Clear                        */
    
    struct {
      __O  uint32_t  CHNL_PRI_ALT_CLR: 14;          /*!< [0..13] CHNL_PRI_ALT_CLR                                              */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_PRI_ALT_CLR;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x50014038) Channel Priority Set                                   */
    
    struct {
      __IO uint32_t  CHNL_PRIORITY_SET: 14;         /*!< [0..13] CHNL_PRIORITY_SET: 0b0=on read: DMA channel C is using
                                                         the default priority level., 0b1=on read: DMA channel C is using
                                                          a high priority level., 0b0=on write: No effect. Use the CHNL_ENABLE_CLR
                                                          Register to set channel C to the default priority level., 0b1=on
                                                          write: Channel C uses the high priority level.,                      */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_PRIORITY_SET;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x5001403C) Channel Priority Clear                                 */
    
    struct {
      __O  uint32_t  CHNL_PRIORITY_CLR: 14;         /*!< [0..13] CHNL_PRIORITY_CLR                                             */
    } bit;                                          /*!< [14] BitSize                                                          */
  } CHNL_PRIORITY_CLR;
  __I  uint32_t  RESERVED0[3];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x5001404C) Bus Error Clear                                        */
    
    struct {
      __IO uint32_t  ERR_CLR    :  1;               /*!< [0..0] ERR_CLR: 0b0=on read: dma_err is LOW., 0b1=on read: dma_err
                                                         is HIGH., 0b0=on write: No effect, status of dma_err is unchanged.,
                                                          0b1=on write: Sets dma_err LOW.,                                     */
    } bit;                                          /*!< [1] BitSize                                                           */
  } ERR_CLR;
} DMA_Type;


/* ================================================================================ */
/* ================                     TIMER3                     ================ */
/* ================================================================================ */


/**
  * @brief TIMER3 (TIMER3)
  */

typedef struct {                                    /*!< (@ 0x48006000) TIMER3 Structure                                       */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48006000) T3 Trigger Control                                     */
    
    struct {
      __IO uint32_t  T3_TRIGG_INP_SEL:  3;          /*!< [0..2] Timer 3 Trigger Input Event Selection (only in mode3b)         */
           uint32_t             :  1;
      __IO uint32_t  T3_RES_CONF:  2;               /*!< [4..5] Timer 3 Trigger Reset Selection for Mode 1b                    */
      __IO uint32_t  RETRIG     :  1;               /*!< [6..6] Retrigger Condition (in mode 1b) for CCU6-T12 ZM and
                                                         CCU6 PM                                                               */
    } bit;                                          /*!< [7] BitSize                                                           */
  } T3_TRIGG_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48006004) Timer 3 Compare Value                                  */
    
