alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint32_t  LO         :  8;               /*!< [0..7] Timer 3 Compare Value Low Byte                                 */
      __IO uint32_t  HI         :  8;               /*!< [8..15] Timer 3 Compare Value High Byte                               */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CMP;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48006008) Timer 3                                                */
    
    struct {
      __IO uint32_t  LO         :  8;               /*!< [0..7] Timer 3 Low Register or Preload Value                          */
      __IO uint32_t  HI         :  8;               /*!< [8..15] Timer 3 High Register or Preload Value                        */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CNT;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4800600C) Timer 3 Control Register                               */
    
    struct {
      __IO uint32_t  T3_PD_N    :  1;               /*!< [0..0] Timer 3 Power Down                                             */
      __IO uint32_t  T3_RD_REQ  :  1;               /*!< [1..1] Timer 3 Value Read Request                                     */
      __IO uint32_t  T3_RD_REQ_CONF:  1;            /*!< [2..2] Timer 3 Read Mode                                              */
      __IO uint32_t  CNT_RDY    :  1;               /*!< [3..3] Timer 3 Count Ready                                            */
      __IO uint32_t  TR3H       :  1;               /*!< [4..4] Timer 3 Run Control (High Byte Timer)                          */
      __I  uint32_t  T3H_OVF_STS:  1;               /*!< [5..5] Timer 3 Overflow Flag (High Byte Timer)                        */
      __IO uint32_t  TR3L       :  1;               /*!< [6..6] Timer 3 Run Control (Low Byte Timer)                           */
      __I  uint32_t  T3L_OVF_STS:  1;               /*!< [7..7] Timer 3 Overflow Flag (Low Byte Timer)                         */
      __IO uint32_t  T3L_OVF_IE :  1;               /*!< [8..8] Timer 3 Overflow Interrupt Enable (Low Byte Timer)             */
      __IO uint32_t  T3H_OVF_IE :  1;               /*!< [9..9] Timer 3 Overflow Interrupt Enable (High Byte Timer)            */
    } bit;                                          /*!< [10] BitSize                                                          */
  } CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48006010) Timer 3 Mode Configuration Register                    */
    
    struct {
      __IO uint32_t  T3M        :  2;               /*!< [0..1] Mode Select Bits                                               */
           uint32_t             :  4;
      __IO uint32_t  T3_SUBM    :  2;               /*!< [6..7] Sub-Mode Select Bits                                           */
    } bit;                                          /*!< [8] BitSize                                                           */
  } MODE_CONF;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x48006014) Timer 3 Interrupt Status Clear Register                */
    
    struct {
           uint32_t             :  5;
      __O  uint32_t  T3H_OVF_ICLR:  1;              /*!< [5..5] Timer 3 Overflow Flag (High Byte Timer) Interrupt Clear        */
           uint32_t             :  1;
      __O  uint32_t  T3L_OVF_ICLR:  1;              /*!< [7..7] Timer 3 Overflow Flag (Low Byte Timer) Interrupt Clear         */
    } bit;                                          /*!< [8] BitSize                                                           */
  } ISRCLR;
} TIMER3_Type;


/* ================================================================================ */
/* ================                       LIN                      ================ */
/* ================================================================================ */


/**
  * @brief LIN (LIN)
  */

typedef struct {                                    /*!< (@ 0x4801E000) LIN Structure                                          */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801E000) LIN Transceiver Control and Status                     */
    
    struct {
           uint32_t             :  1;
      __IO uint32_t  MODE       :  2;               /*!< [1..2] LIN transceiver power mode control                             */
      __I  uint32_t  M_SM_ERR   :  1;               /*!< [3..3] LIN Transceiver Mode or Slope Mode Error                       */
      __I  uint32_t  OT_STS     :  1;               /*!< [4..4] LIN Receiver Overtemperature Status                            */
      __I  uint32_t  OC_STS     :  1;               /*!< [5..5] LIN Receiver Overcurrent Status                                */
      __I  uint32_t  TXD_TMOUT_STS:  1;             /*!< [6..6] LIN TXD time-out status                                        */
           uint32_t             :  2;
      __IO uint32_t  TXD        :  1;               /*!< [9..9] LIN Transmitter switch on (only used when LIN_HV_MODE
                                                         is set)                                                               */
      __I  uint32_t  RXD        :  1;               /*!< [10..10] Output Signal of Receiver                                    */
      __IO uint32_t  SM         :  2;               /*!< [11..12] LIN Transmitter Slope mode control                           */
      __I  uint32_t  FB_SM1     :  1;               /*!< [13..13] Feedback Signal 1 for Slope Mode Setting                     */
      __I  uint32_t  FB_SM2     :  1;               /*!< [14..14] Feedback Signal 2 for Slope Mode Setting                     */
      __I  uint32_t  FB_SM3     :  1;               /*!< [15..15] Feedback Signal 3 for Slope Mode Setting                     */
      __I  uint32_t  MODE_FB    :  3;               /*!< [16..18] Feedback Signals for LIN Transmitter Mode Settings           */
           uint32_t             :  2;
      __IO uint32_t  HV_MODE    :  1;               /*!< [21..21] LIN Transceiver High Voltage Input - Output Mode             */
           uint32_t             :  2;
      __O  uint32_t  M_SM_ERR_CLR:  1;              /*!< [24..24] LIN Transceiver Mode or Slope Mode Error Clear               */
    } bit;                                          /*!< [25] BitSize                                                          */
  } CTRL_STS;
} LIN_Type;


/* ================================================================================ */
/* ================                       MF                       ================ */
/* ================================================================================ */


/**
  * @brief MF (MF)
  */

typedef struct {                                    /*!< (@ 0x48018000) MF Structure                                           */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48018000) Port 2 ADC Selection Control Register                  */
    
