alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
           uint32_t             : 10;
      __IO uint32_t  ADC1_CH1_SEL:  1;              /*!< [10..10] ADC1 Channel 1 Input Selection                               */
    } bit;                                          /*!< [11] BitSize                                                          */
  } P2_ADCSEL_CTRL;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48018004) Supply Sense Control Register                          */
    
    struct {
      __IO uint32_t  VMON_SEN_PD_N:  1;             /*!< [0..0] Monitoring Input Attenuator enable                             */
           uint32_t             :  3;
      __IO uint32_t  VMON_SEN_HRESO_5V:  1;         /*!< [4..4] Monitoring Input Attenuator High Impedance Output Control      */
      __IO uint32_t  VMON_SEN_SEL_INRANGE:  1;      /*!< [5..5] Monitoring Input Attenuator Select Inputrange                  */
    } bit;                                          /*!< [6] BitSize                                                           */
  } VMON_SEN_CTRL;
  __I  uint32_t  RESERVED0[2];
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x48018010) Temperature Sensor Control Register                    */
    
    struct {
           uint32_t             :  4;
      __I  uint32_t  PMU_OTWARN_STS:  1;            /*!< [4..4] PMU Regulator Overtemperature Warning (MU) Status              */
      __I  uint32_t  PMU_OT_STS :  1;               /*!< [5..5] PMU Regulator Overtemperature (MU) Status                      */
      __I  uint32_t  SYS_OTWARN_STS:  1;            /*!< [6..6] System Overtemperature Warning (MU) Status                     */
      __I  uint32_t  SYS_OT_STS :  1;               /*!< [7..7] System Overtemperature (MU) Status                             */
    } bit;                                          /*!< [8] BitSize                                                           */
  } TEMPSENSE_CTRL;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x48018014) Reference 1 Status Register                            */
    
    struct {
           uint32_t             :  4;
      __I  uint32_t  REFBG_LOTHWARN_STS:  1;        /*!< [4..4] Status for Undervoltage Threshold Measurement of internal
                                                         VAREF                                                                 */
      __I  uint32_t  REFBG_UPTHWARN_STS:  1;        /*!< [5..5] Status for Overvoltage Threshold Measurement of internal
                                                         VAREF                                                                 */
    } bit;                                          /*!< [6] BitSize                                                           */
  } REF1_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x48018018) Reference 2 Control Register                           */
    
    struct {
      __IO uint32_t  VREF5V_PD_N:  1;               /*!< [0..0] ADC1 Bit Reference Voltage Generation Power Down Bit           */
      __I  uint32_t  VREF5V_OVL_STS:  1;            /*!< [1..1] ADC1 Bit Reference Voltage Generation Over Load Bit            */
      __I  uint32_t  VREF5V_UV_STS:  1;             /*!< [2..2] ADC1 Bit Reference Voltage Generation Undervoltage Bit         */
      __I  uint32_t  VREF5V_OV_STS:  1;             /*!< [3..3] ADC1 Bit Reference Voltage Generation Overvoltage Bit          */
    } bit;                                          /*!< [4] BitSize                                                           */
  } REF2_CTRL;
} MF_Type;


/* ================================================================================ */
/* ================                      ADC2                      ================ */
/* ================================================================================ */


/**
  * @brief ADC2 (ADC2)
  */

typedef struct {                                    /*!< (@ 0x4801C000) ADC2 Structure                                         */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C000) ADC2 Control and Status Register                       */
    
    struct {
           uint32_t             : 16;
      __IO uint32_t  VBAT_RANGE :  1;               /*!< [16..16] ADC2 Channel 0 Range Selection                               */
      __IO uint32_t  VS_RANGE   :  1;               /*!< [17..17] ADC2 Channel 1 Range Selection                               */
    } bit;                                          /*!< [18] BitSize                                                          */
  } CTRL_STS;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C004) Sequencer Feedback Register                            */
    
    struct {
      __I  uint32_t  SQ_FB      :  4;               /*!< [0..3] Current Sequence that caused software mode                     */
           uint32_t             :  4;
      __I  uint32_t  SQ_STOP    :  1;               /*!< [8..8] ADC2 Sequencer Stop Signal for DPP                             */
      __I  uint32_t  EIM_ACTIVE :  1;               /*!< [9..9] ADC2 EIM active                                                */
      __I  uint32_t  ESM_ACTIVE :  1;               /*!< [10..10] ADC2 ESM active                                              */
      __I  uint32_t  SQx        :  4;               /*!< [11..14] Current Active Sequencer                                     */
           uint32_t             :  1;
      __I  uint32_t  CHx        :  5;               /*!< [16..20] Current ADC2 Channel                                         */
    } bit;                                          /*!< [21] BitSize                                                          */
  } SQ_FB;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C008) Channel Settings Bits for Exceptional Interrupt
                                                         Measurement                                                           */
    
