alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint32_t  CHx        :  5;               /*!< [0..4] Channel set for exceptional interrupt measurement (EIM)        */
           uint32_t             :  3;
      __IO uint32_t  REP        :  3;               /*!< [8..10] Repeat count for exceptional interrupt measurement (EIM)      */
      __IO uint32_t  EN         :  1;               /*!< [11..11] Exceptional interrupt measurement (EIM) Trigger Event
                                                         enable                                                                */
      __IO uint32_t  SEL        :  1;               /*!< [12..12] Exceptional interrupt measurement (EIM) Trigger Trigger
                                                         select                                                                */
    } bit;                                          /*!< [13] BitSize                                                          */
  } CHx_EIM;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C00C) Channel Settings Bits for Exceptional Sequence
                                                         Measurement                                                           */
    
    struct {
      __IO uint32_t  ESM_0      :  6;               /*!< [0..5] Channel Sequence for Exceptional Sequence Measurement
                                                         (ESM)                                                                 */
      __IO uint32_t  ESM_1      :  4;               /*!< [6..9] Channel Sequence for Exceptional Sequence Measurement
                                                         (ESM)                                                                 */
      __IO uint32_t  SEL        :  1;               /*!< [10..10] Exceptional Sequence Measurement Trigger Select              */
           uint32_t             :  5;
      __IO uint32_t  EN         :  1;               /*!< [16..16] Enable for Exceptional Sequence Measurement Trigger
                                                         Event                                                                 */
      __I  uint32_t  STS        :  1;               /*!< [17..17] Exceptional Sequence Measurement is finished                 */
    } bit;                                          /*!< [18] BitSize                                                          */
  } CHx_ESM;
  __I  uint32_t  RESERVED0;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C014) Measurement Unit Control Register 1                    */
    
    struct {
      __IO uint32_t  CALIB_EN   :  6;               /*!< [0..5] Calibration Enable for Channels 0 to 5                         */
    } bit;                                          /*!< [6] BitSize                                                           */
  } CTRL1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C018) Measurement Unit Control Register 2                    */
    
    struct {
      __IO uint32_t  MCM_PD_N   :  1;               /*!< [0..0] Power Down Signal for MCM                                      */
      __IO uint32_t  TS_SD_SEL_CONF:  1;            /*!< [1..1] Temperature Sensor Control Configuration                       */
      __IO uint32_t  TSENSE_SD_SEL:  1;             /*!< [2..2] TSENSE select for channel 9                                    */
           uint32_t             :  4;
      __I  uint32_t  MCM_RDY    :  1;               /*!< [7..7] Ready Signal for MCM after Power On or Reset                   */
      __IO uint32_t  SAMPLE_TIME_int:  4;           /*!< [8..11] Sample time of ADC2                                           */
           uint32_t             :  4;
      __IO uint32_t  SEL_TS_COUNT:  4;              /*!< [16..19] Time for Automatic Muxing of SEL_TS                          */
    } bit;                                          /*!< [20] BitSize                                                          */
  } CTRL2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C01C) Measurement Unit Control Register 4                    */
    
    struct {
      __IO uint32_t  FILT_OUT_SEL_5_0:  6;          /*!< [0..5] Output Filter Selection for Channels 0 to 5                    */
           uint32_t             :  2;
      __IO uint32_t  FILT_OUT_SEL_9_6:  4;          /*!< [8..11] Output Filter Selection for Channels 6 to 9                   */
    } bit;                                          /*!< [12] BitSize                                                          */
  } CTRL4;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C020) Measurement Channel Enable Bits for Cycle 1-4          */
    
    struct {
      __IO uint32_t  SQ1        :  6;               /*!< [0..5] Sequence 1 channel enable                                      */
           uint32_t             :  2;
      __IO uint32_t  SQ2        :  6;               /*!< [8..13] Sequence 2 channel enable                                     */
           uint32_t             :  2;
      __IO uint32_t  SQ3        :  6;               /*!< [16..21] Sequence 3 channel enable                                    */
           uint32_t             :  2;
      __IO uint32_t  SQ4        :  6;               /*!< [24..29] Sequence 4 channel enable                                    */
    } bit;                                          /*!< [30] BitSize                                                          */
  } SQ1_4;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C024) Measurement Channel Enable Bits for Cycle 5 -
                                                         8                                                                     */
    
    struct {
      __IO uint32_t  SQ5        :  6;               /*!< [0..5] Sequence 5 channel enable                                      */
           uint32_t             :  2;
      __IO uint32_t  SQ6        :  6;               /*!< [8..13] Sequence 6 channel enable                                     */
           uint32_t             :  2;
      __IO uint32_t  SQ7        :  6;               /*!< [16..21] Sequence 7 channel enable                                    */
           uint32_t             :  2;
      __IO uint32_t  SQ8        :  6;               /*!< [24..29] Sequence 8 channel enable                                    */
    } bit;                                          /*!< [30] BitSize                                                          */
  } SQ5_8;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C028) Measurement Channel Enable Bits for Cycle 9 -
                                                         10                                                                    */
    
