alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __I  uint32_t  OFFS_CH8   :  8;               /*!< [0..7] Offset Calibration for channel 8                               */
      __I  uint32_t  GAIN_CH8   :  8;               /*!< [8..15] Gain Calibration for channel 8                                */
      __I  uint32_t  OFFS_CH9   :  8;               /*!< [16..23] Offset Calibration for channel 9                             */
      __I  uint32_t  GAIN_CH9   :  8;               /*!< [24..31] Gain Calibration for channel 9                               */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CAL_CH8_9;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801C048) Filter Coefficients ADC Channel 0-5                    */
    
    struct {
      __IO uint32_t  CH0        :  2;               /*!< [0..1] Filter Coefficients ADC channel 0                              */
      __IO uint32_t  CH1        :  2;               /*!< [2..3] Filter Coefficients ADC channel 1                              */
      __IO uint32_t  CH2        :  2;               /*!< [4..5] Filter Coefficients ADC channel 2                              */
      __IO uint32_t  CH3        :  2;               /*!< [6..7] Filter Coefficients ADC channel 3                              */
      __IO uint32_t  CH4        :  2;               /*!< [8..9] Filter Coefficients ADC channel 4                              */
      __IO uint32_t  CH5        :  2;               /*!< [10..11] Filter Coefficients ADC channel 5                            */
    } bit;                                          /*!< [12] BitSize                                                          */
  } FILTCOEFF0_5;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C04C) Filter Coefficents ADC Channel 6-9                     */
    
    struct {
      __I  uint32_t  CH6        :  2;               /*!< [0..1] Filter Coefficients ADC channel 6                              */
      __I  uint32_t  CH7        :  2;               /*!< [2..3] Filter Coefficients ADC channel 7                              */
      __I  uint32_t  CH8        :  2;               /*!< [4..5] Filter Coefficients ADC channel 8                              */
      __I  uint32_t  CH9        :  2;               /*!< [6..7] Filter Coefficients ADC channel 9                              */
    } bit;                                          /*!< [8] BitSize                                                           */
  } FILTCOEFF6_9;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C050) ADC or Filter Output Channel 0                         */
    
    struct {
      __I  uint32_t  OUT_CH0    : 10;               /*!< [0..9] ADC or filter output value channel 0                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT0;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C054) ADC or Filter Output Channel 1                         */
    
    struct {
      __I  uint32_t  OUT_CH1    : 10;               /*!< [0..9] ADC or filter output value channel 1                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT1;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C058) ADC or Filter Output Channel 2                         */
    
    struct {
      __I  uint32_t  OUT_CH2    : 10;               /*!< [0..9] ADC or filter output value channel 2                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT2;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C05C) ADC or Filter Output Channel 3                         */
    
    struct {
      __I  uint32_t  OUT_CH3    : 10;               /*!< [0..9] ADC or filter output value channel 3                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT3;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C060) ADC or Filter Output Channel 4                         */
    
    struct {
      __I  uint32_t  OUT_CH4    : 10;               /*!< [0..9] ADC or filter output value channel 4                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT4;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C064) ADC or Filter Output Channel 5                         */
    
    struct {
      __I  uint32_t  OUT_CH5    : 10;               /*!< [0..9] ADC or filter output value channel 5                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT5;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C068) ADC or Filter Output Channel 6                         */
    
    struct {
      __I  uint32_t  OUT_CH6    : 10;               /*!< [0..9] ADC or filter output value channel 6                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT6;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C06C) ADC or Filter Output Channel 7                         */
    
    struct {
      __I  uint32_t  OUT_CH7    : 10;               /*!< [0..9] ADC or filter output value channel 7                           */
    } bit;                                          /*!< [10] BitSize                                                          */
  } FILT_OUT7;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x4801C070) ADC or Filter Output Channel 8                         */
    
