alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __I  uint32_t  OUT_CH_EIM : 12;               /*!< [0..11] ADC1 output result value EIM                                  */
           uint32_t             :  4;
      __IO uint32_t  WFR8       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF8        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF8        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } RES_OUT_EIM;
  __I  uint32_t  RESERVED3[3];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004050) Sequencer Feedback Register                            */
    
    struct {
           uint32_t             :  8;
      __IO uint32_t  SQ_RUN     :  1;               /*!< [8..8] ADC1 Sequencer RUN                                             */
      __I  uint32_t  EIM_ACTIVE :  1;               /*!< [9..9] ADC1 EIM active                                                */
      __I  uint32_t  ESM_ACTIVE :  1;               /*!< [10..10] ADC1 ESM active                                              */
      __I  uint32_t  SQx        :  3;               /*!< [11..13] Current Active Sequence in Sequencer Mode                    */
           uint32_t             :  2;
      __I  uint32_t  CHx        :  3;               /*!< [16..18] Current Channel                                              */
    } bit;                                          /*!< [19] BitSize                                                          */
  } SQ_FB;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004054) ADC1 Output Channel 7                                  */
    
    struct {
      __I  uint32_t  OUT_CH7    : 12;               /*!< [0..11] ADC1 output result value channel 7                            */
           uint32_t             :  4;
      __IO uint32_t  WFR7       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF7        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF7        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } RES_OUT7;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004058) ADC1 Output Channel 6                                  */
    
    struct {
      __I  uint32_t  OUT_CH6    : 12;               /*!< [0..11] ADC1 output result value channel 6                            */
           uint32_t             :  4;
      __IO uint32_t  WFR6       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF6        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF6        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } RES_OUT6;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000405C) ADC1 Output Channel 5                                  */
    
    struct {
      __I  uint32_t  OUT_CH5    : 12;               /*!< [0..11] ADC1 output result value channel 5                            */
           uint32_t             :  4;
      __IO uint32_t  WFR5       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF5        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF5        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } RES_OUT5;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004060) ADC1 Output Channel 4                                  */
    
    struct {
      __I  uint32_t  OUT_CH4    : 12;               /*!< [0..11] ADC1 output result value channel 4                            */
           uint32_t             :  4;
      __IO uint32_t  WFR4       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF4        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF4        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } RES_OUT4;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004064) ADC1 Output Channel 3                                  */
    
    struct {
      __I  uint32_t  OUT_CH3    : 12;               /*!< [0..11] ADC1 output result value channel 3                            */
           uint32_t             :  4;
      __IO uint32_t  WFR3       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF3        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF3        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } RES_OUT3;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004068) ADC1 Output Channel 2                                  */
    
