alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __I  uint32_t  OUT_CH2    : 12;               /*!< [0..11] ADC1 output result value channel 2                            */
           uint32_t             :  4;
      __IO uint32_t  WFR2       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF2        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF2        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } RES_OUT2;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000406C) ADC1 Output Channel 1                                  */
    
    struct {
      __I  uint32_t  OUT_CH1    : 12;               /*!< [0..11] ADC1 output result value channel 1                            */
           uint32_t             :  4;
      __IO uint32_t  WFR1       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF1        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF1        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } RES_OUT1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40004070) ADC1 Output Channel 0                                  */
    
    struct {
      __I  uint32_t  OUT_CH0    : 12;               /*!< [0..11] ADC1 output reset value channel 0                             */
           uint32_t             :  4;
      __IO uint32_t  WFR0       :  1;               /*!< [16..16] Wait for Read Mode                                           */
      __I  uint32_t  VF0        :  1;               /*!< [17..17] Valid Flag                                                   */
      __I  uint32_t  OF0        :  1;               /*!< [18..18] Overrun Flag                                                 */
    } bit;                                          /*!< [19] BitSize                                                          */
  } RES_OUT0;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x40004074) Global Status Register                                 */
    
    struct {
      __I  uint32_t  BUSY       :  1;               /*!< [0..0] Analog Part Busy                                               */
      __I  uint32_t  SAMPLE     :  1;               /*!< [1..1] Sample Phase Indication                                        */
           uint32_t             :  1;
      __I  uint32_t  CHNR       :  3;               /*!< [3..5] Channel Number                                                 */
           uint32_t             :  2;
      __I  uint32_t  ANON_ST    :  2;               /*!< [8..9] Analog Part Switched On                                        */
    } bit;                                          /*!< [10] BitSize                                                          */
  } GLOBSTR;
  
  union {
    __I  uint32_t  reg;                             /*!< (@ 0x40004078) ADC1 Interrupt Status Register                         */
    
    struct {
      __I  uint32_t  CH0_STS    :  1;               /*!< [0..0] ADC1 Channel 0 Interrupt Status                                */
      __I  uint32_t  CH1_STS    :  1;               /*!< [1..1] ADC1 Channel 1 Interrupt Status                                */
      __I  uint32_t  CH2_STS    :  1;               /*!< [2..2] ADC1 Channel 2 Interrupt Status                                */
      __I  uint32_t  CH3_STS    :  1;               /*!< [3..3] ADC1 Channel 3 Interrupt Status                                */
      __I  uint32_t  CH4_STS    :  1;               /*!< [4..4] ADC1 Channel 4 Interrupt Status                                */
      __I  uint32_t  CH5_STS    :  1;               /*!< [5..5] ADC1 Channel 5 Interrupt Status                                */
      __I  uint32_t  CH6_STS    :  1;               /*!< [6..6] ADC1 Channel 6 Interrupt Status                                */
      __I  uint32_t  CH7_STS    :  1;               /*!< [7..7] ADC1 Channel 7 Interrupt Status                                */
      __I  uint32_t  EIM_STS    :  1;               /*!< [8..8] Exceptional Interrupt Measurement (EIM) Status                 */
      __I  uint32_t  ESM_STS    :  1;               /*!< [9..9] Exceptional Sequence Measurement (ESM) Status                  */
    } bit;                                          /*!< [10] BitSize                                                          */
  } IS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4000407C) ADC1 Interrupt Enable Register                         */
    
    struct {
      __IO uint32_t  CH0_IE     :  1;               /*!< [0..0] ADC1 Channel 0 Interrupt Enable                                */
      __IO uint32_t  CH1_IE     :  1;               /*!< [1..1] ADC1 Channel 1 Interrupt Enable                                */
      __IO uint32_t  CH2_IE     :  1;               /*!< [2..2] ADC1 Channel 2 Interrupt Enable                                */
      __IO uint32_t  CH3_IE     :  1;               /*!< [3..3] ADC1 Channel 3 Interrupt Enable                                */
      __IO uint32_t  CH4_IE     :  1;               /*!< [4..4] ADC1 Channel 4 Interrupt Enable                                */
      __IO uint32_t  CH5_IE     :  1;               /*!< [5..5] ADC1 Channel 5 Interrupt Enable                                */
      __IO uint32_t  CH6_IE     :  1;               /*!< [6..6] ADC1 Channel 6 Interrupt Enable                                */
      __IO uint32_t  CH7_IE     :  1;               /*!< [7..7] ADC1 Channel 7 Interrupt Enable                                */
      __IO uint32_t  EIM_IE     :  1;               /*!< [8..8] Exceptional Interrupt Measurement (EIM) Interrupt Enable       */
      __IO uint32_t  ESM_IE     :  1;               /*!< [9..9] Exceptional Sequence Measurement (ESM) Interrupt Enable        */
    } bit;                                          /*!< [10] BitSize                                                          */
  } IE;
  
  union {
    __O  uint32_t  reg;                             /*!< (@ 0x40004080) ADC1 Interrupt Status Clear Register                   */
    
