alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __O  uint32_t  CH0_ICLR   :  1;               /*!< [0..0] ADC1 Channel 0 Interrupt Status Clear                          */
      __O  uint32_t  CH1_ICLR   :  1;               /*!< [1..1] ADC1 Channel 1 Interrupt Status Clear                          */
      __O  uint32_t  CH2_ICLR   :  1;               /*!< [2..2] ADC1 Channel 2 Interrupt Status Clear                          */
      __O  uint32_t  CH3_ICLR   :  1;               /*!< [3..3] ADC1 Channel 3 Interrupt Status Clear                          */
      __O  uint32_t  CH4_ICLR   :  1;               /*!< [4..4] ADC1 Channel 4 Interrupt Status Clear                          */
      __O  uint32_t  CH5_ICLR   :  1;               /*!< [5..5] ADC1 Channel 5 Interrupt Status Clear                          */
      __O  uint32_t  CH6_ICLR   :  1;               /*!< [6..6] ADC1 Channel 6 Interrupt Status Clear                          */
      __O  uint32_t  CH7_ICLR   :  1;               /*!< [7..7] ADC1 Channel 7 Interrupt Status Clear                          */
      __O  uint32_t  EIM_ICLR   :  1;               /*!< [8..8] Exceptional Interrupt Measurement (EIM) Status Clear           */
      __O  uint32_t  ESM_ICLR   :  1;               /*!< [9..9] Exceptional Sequence Measurement (ESM) Status Clear            */
    } bit;                                          /*!< [10] BitSize                                                          */
  } ICLR;
} ADC1_Type;


/* ================================================================================ */
/* ================                      BDRV                      ================ */
/* ================================================================================ */


/**
  * @brief BDRV (BDRV)
  */

typedef struct {                                    /*!< (@ 0x40034000) BDRV Structure                                         */
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40034000) H-Bridge Driver Control 1                              */
    
    struct {
      __IO uint32_t  LS1_EN     :  1;               /*!< [0..0] Low Side Driver 1 Enable                                       */
      __IO uint32_t  LS1_PWM    :  1;               /*!< [1..1] Low Side Driver 1 PWM Enable                                   */
      __IO uint32_t  LS1_ON     :  1;               /*!< [2..2] Low Side Driver 1 On                                           */
      __IO uint32_t  LS1_DCS_EN :  1;               /*!< [3..3] Low Side Driver 1 Diagnosis Current Source Enable              */
      __I  uint32_t  LS1_DS_STS :  1;               /*!< [4..4] Low Side Driver 1 Drain Source Monitoring Status in OFF-State  */
      __I  uint32_t  LS1_SUPERR_STS:  1;            /*!< [5..5] Low Side Driver 1 Supply Error Status                          */
      __I  uint32_t  LS1_OC_STS :  1;               /*!< [6..6] External Low Side 1 FET Over-current Status                    */
      __IO uint32_t  LS1_OC_DIS :  1;               /*!< [7..7] Low Side Driver 1 Overcurrent Shutdown Disable                 */
      __IO uint32_t  LS2_EN     :  1;               /*!< [8..8] Low Side Driver 2 Enable                                       */
      __IO uint32_t  LS2_PWM    :  1;               /*!< [9..9] Low Side Driver 2 PWM Enable                                   */
      __IO uint32_t  LS2_ON     :  1;               /*!< [10..10] Low Side Driver 2 On                                         */
      __IO uint32_t  LS2_DCS_EN :  1;               /*!< [11..11] Low Side Driver 2 Diagnosis Current Source Enable            */
      __I  uint32_t  LS2_DS_STS :  1;               /*!< [12..12] Low Side Driver 2 Drain Source Monitoring Status in
                                                         OFF-State                                                             */
      __I  uint32_t  LS2_SUPERR_STS:  1;            /*!< [13..13] Low Side Driver 2 Supply Error Status                        */
      __I  uint32_t  LS2_OC_STS :  1;               /*!< [14..14] External Low Side 2 FET Over-current Status                  */
      __IO uint32_t  LS2_OC_DIS :  1;               /*!< [15..15] Low Side Driver Overcurrent Shutdown Disable                 */
      __IO uint32_t  HS1_EN     :  1;               /*!< [16..16] High Side Driver 1 Enable                                    */
      __IO uint32_t  HS1_PWM    :  1;               /*!< [17..17] High Side Driver 1 PWM Enable                                */
      __IO uint32_t  HS1_ON     :  1;               /*!< [18..18] High Side Driver 1 On                                        */
      __IO uint32_t  HS1_DCS_EN :  1;               /*!< [19..19] High Side Driver 1 Diagnosis Current Source Enable           */
      __I  uint32_t  HS1_DS_STS :  1;               /*!< [20..20] High Side Driver 1 Drain Source Monitoring Status in
                                                         OFF-State                                                             */
      __I  uint32_t  HS1_SUPERR_STS:  1;            /*!< [21..21] High Side Driver 1 Supply Error Status                       */
      __I  uint32_t  HS1_OC_STS :  1;               /*!< [22..22] External High Side 1 FET Over-current Status                 */
      __IO uint32_t  HS1_OC_DIS :  1;               /*!< [23..23] High Side Driver Overcurrent Shutdown Disable                */
      __IO uint32_t  HS2_EN     :  1;               /*!< [24..24] High Side Driver 2 Enable                                    */
      __IO uint32_t  HS2_PWM    :  1;               /*!< [25..25] High Side Driver 2 PWM Enable                                */
      __IO uint32_t  HS2_ON     :  1;               /*!< [26..26] High Side Driver 2 On                                        */
      __IO uint32_t  HS2_DCS_EN :  1;               /*!< [27..27] High Side Driver 2 Diagnosis Current Source Enable           */
      __I  uint32_t  HS2_DS_STS :  1;               /*!< [28..28] High Side Driver 2 Drain Source Monitoring Status in
                                                         OFF-State                                                             */
      __I  uint32_t  HS2_SUPERR_STS:  1;            /*!< [29..29] High Side Driver 2 Supply Error Status                       */
      __I  uint32_t  HS2_OC_STS :  1;               /*!< [30..30] External High Side 2 FET Over-current Status                 */
      __IO uint32_t  HS2_OC_DIS :  1;               /*!< [31..31] High Side Driver Overcurrent Shutdown Disable                */
    } bit;                                          /*!< [32] BitSize                                                          */
  } CTRL1;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40034004) H-Bridge Driver Control 2                              */
    
