alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/TLE986x_series/Include/TLE986x.h
    struct {
      __IO uint32_t  CP_EN      :  1;               /*!< [0..0] Charge Pump Enable                                             */
           uint32_t             :  1;
      __IO uint32_t  CP_RDY_EN  :  1;               /*!< [2..2] Bridge Driver on Charge Pump Ready Enable                      */
           uint32_t             :  2;
      __I  uint32_t  VCP_LOTH2_STS:  1;             /*!< [5..5] Charge Pump Low Status                                         */
           uint32_t             :  2;
      __IO uint32_t  VCP_LOWTH2 :  3;               /*!< [8..10] Charge Pump Output Voltage Lower Threshold Detection
                                                         Level                                                                 */
           uint32_t             :  5;
      __IO uint32_t  DRVx_VCPLO_DIS:  1;            /*!< [16..16] Driver On Charge Pump Low Voltage Disable                    */
      __I  uint32_t  VCP_LOTH1_STS:  1;             /*!< [17..17] Charge Pump MU Low Status                                    */
      __IO uint32_t  DRVx_VCPUP_DIS:  1;            /*!< [18..18] Driver On Charge Pump Upper Voltage Disable                  */
      __I  uint32_t  VCP_UPTH_STS:  1;              /*!< [19..19] Charge Pump MU High Status                                   */
      __IO uint32_t  DRVx_VSDLO_DIS:  1;            /*!< [20..20] Driver On VSD Lower Voltage Disable                          */
      __I  uint32_t  VSD_LOTH_STS:  1;              /*!< [21..21] Driver Supply MU Low Status                                  */
      __IO uint32_t  DRVx_VSDUP_DIS:  1;            /*!< [22..22] Driver On VSD Upper Voltage Disable                          */
      __I  uint32_t  VSD_UPTH_STS:  1;              /*!< [23..23] Driver Supply MU High Status                                 */
      __IO uint32_t  CPLOPWRM_EN:  1;               /*!< [24..24] Charge Pump Low Power Mode Enable                            */
      __IO uint32_t  VCP9V_SET  :  1;               /*!< [25..25] Charge Pump 9 V Output Voltage Set                           */
      __IO uint32_t  VTHVCP9V_TRIM:  2;             /*!< [26..27] Charge Pump Output Voltage 9V Trimming                       */
    } bit;                                          /*!< [28] BitSize                                                          */
  } CP_CTRL_STS;
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x40034024) Charge Pump Clock Control Register                     */
    
    struct {
      __IO uint32_t  DITH_LOWER :  5;               /*!< [0..4] CP_CLK lower frequency boundary during dithering               */
           uint32_t             :  3;
      __IO uint32_t  DITH_UPPER :  5;               /*!< [8..12] CP_CLK upper frequency boundary during dithering              */
      __IO uint32_t  F_CP       :  2;               /*!< [13..14] MSB of CP_CLK divider                                        */
      __IO uint32_t  CPCLK_EN   :  1;               /*!< [15..15] Charge Pump Clock Enable                                     */
    } bit;                                          /*!< [16] BitSize                                                          */
  } CP_CLK_CTRL;
} BDRV_Type;


/* ================================================================================ */
/* ================                       MON                      ================ */
/* ================================================================================ */


/**
  * @brief MON (MON)
  */

typedef struct {                                    /*!< (@ 0x50004000) MON Structure                                          */
  __I  uint32_t  RESERVED0[13];
  
  union {
    __IO uint8_t   reg;                             /*!< (@ 0x50004034) Settings Monitor 1                                     */
    
    struct {
      __IO uint8_t   EN         :  1;               /*!< [0..0] MON Enable                                                     */
      __IO uint8_t   FALL       :  1;               /*!< [1..1] MON Wake-up on Falling Edge Enable                             */
      __IO uint8_t   RISE       :  1;               /*!< [2..2] MON Wake-up on Rising Edge Enable                              */
      __IO uint8_t   CYC        :  1;               /*!< [3..3] MON for Cycle Sense Enable                                     */
      __IO uint8_t   PD         :  1;               /*!< [4..4] Pull-Down Current Source for MON Input Enable                  */
      __IO uint8_t   PU         :  1;               /*!< [5..5] Pull-Up Current Source for MON Input Enable                    */
           uint8_t              :  1;
      __I  uint8_t   STS        :  1;               /*!< [7..7] MON Status Input                                               */
    } bit;                                          /*!< [8] BitSize                                                           */
  } CNF;
} MON_Type;


/* ================================================================================ */
/* ================                       CSA                      ================ */
/* ================================================================================ */


/**
  * @brief CSA (CSA)
  */

typedef struct {                                    /*!< (@ 0x48018000) CSA Structure                                          */
  __I  uint32_t  RESERVED0[3];
  
  union {
    __IO uint32_t  reg;                             /*!< (@ 0x4801800C) Current Sense Amplifier Control Register               */
    
    struct {
      __IO uint32_t  EN         :  1;               /*!< [0..0] OPA enable                                                     */
      __IO uint32_t  GAIN       :  4;               /*!< [1..4] OPA gain setting                                               */
           uint32_t             :  3;
      __IO uint32_t  VZERO      :  1;               /*!< [8..8] Current Sense Output Voltage Level to Ground                   */
    } bit;                                          /*!< [9] BitSize                                                           */
  } CTRL;
} CSA_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  /* TBD. pragmas for anonymous unions */
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

